"use client";
import React, { useEffect, useRef } from "react";
import { useSearchParams } from "next/navigation";
import Header5 from "@/components/headers/Header5";
import MobileHeader1 from "@/components/headers/MobailHeader1";

const TermsConditions = () => {
  const searchParams = useSearchParams();
  const marketingTermsRef = useRef(null);

  useEffect(() => {
    if (searchParams.get("section") === "marketing") {
      setTimeout(() => {
        marketingTermsRef.current?.scrollIntoView({ behavior: "smooth" });
      }, 100);
    }
  }, [searchParams]);

  return (
    <>
      <div className="max-w-4xl mx-auto p-6 space-y-8 mt-[80px]">
        <h1 className="text-2xl font-bold">კონფიდენციალურობის განაცხადი</h1>
        <p className="text-gray-600">
          სს „სადაზღვევო კომპანია ალდაგი“ პატივს სცემს თქვენი პირადი ცხოვრებისა
          და პერსონალურ მონაცემთა დაცვის უფლებებს. ჩვენთვის პრიორიტეტულია,
          პერსონალური მონაცემები დავამუშაოთ კონფიდენციალურობის დაცვის საუკეთესო
          პრაქტიკისა და მოქმედი კანონმდებლობის შესაბამისად. ამ განაცხადში
          აღწერილია ვებგვერდის - www.aldagi.ge მეშვეობით, თქვენი პერსონალური
          მონაცემების დამუშავების პროცესი და წარმოდგენილია თქვენი მონაცემთა
          დაცვის უფლებები და მათი რეალიზების მექანიზმები. განაცხადში გამოყენებულ
          ტერმინებს აქვთ „პერსონალურ მონაცემთა დაცვის შესახებ“ საქართველოს
          კანონით და სხვა ნორმატიული აქტებით განსაზღვრული მნიშვნელობა.
        </p>

        <div className="space-y-6">
          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              ვინ არის პასუხისმგებელი თქვენი მონაცემების დამუშავებაზე?
            </h2>
            <p className="text-gray-600">
              კომპანიის სრული სახელწოდება და პროფილი: სს „სადაზღვევო
              კომპანიაალდაგი“, ს/ნ: 404476189 (შემდეგში „ჩვენ“, „ალდაგი“ ან/და
              „კომპანია“) - საქართველოს კანონმდებლობის შესაბამისად შექმნილი,
              ლიცენზირებულისადაზღვევო კომპანიაა. მისი ძირითადი საქმიანობაა
              სადაზღვევო მომსახურების გაწევა სხვადასხვა სფეროში, კერძოდ: ავტო,
              ქონების, აგრო, სიცოცხლისა და კრიტიკული დაავადებების, პროფესიული
              პასუხისმგებლობის, ტვირთების, სამოგზაურო დაზღვევა და სხვა. ალდაგი
              მოქმედებს როგორც მონაცემთა დამუშავებისთვის პასუხისმგებლი პირი.
              მისამართი და საკონტაქტო მონაცემები: ანა პოლიტკოვსკაიას ქუჩა №16.
              0186, თბილისი, საქართველო; ტელ: +995 322 444 999; ელ.ფოსტა:
              info@aldagi.ge. პერსონალურ მონაცემთა დაცვის ოფიცერი: შპს “Privacy
              Professionals“ (ს/ნ: 405682916); ტელ.: 577 070 591; 599 900 215;
              ელ. ფოსტა: privacyprofessionalsgeo@gmail.com.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">რა მონაცემებს ვამუშავებთ?</h2>
            <p className="text-gray-600">
              ჩვენ, როგორც სადაზღვევო კომპანიას, საქართველოს მოქმედი
              კანონმდებლობის შესაბამისად, გვესაჭიროება ინფორმაცია დაზღვევის
              ხელშეკრულების გასაფორმებლად და აღნიშნულ ინფორმაციას ჩვენ ვღებულობთ
              უშუალოდ თქვენგან. ამგვარი მონაცემები როგორც წესი, არ არის საჯაროდ
              ხელმისაწვდომი. კომპანიის მიერ დამუშავებული მონაცემების კატეგორია
              დამოკიდებულია შემოთავაზებული დაზღვევის ტიპზე და შესაძლოა მოიცავდეს
              ქვემოთ ჩამოთვლილს: მაიდენტიფიცირებელი მონაცემები: სახელი, გვარი,
              ასაკი, სქესი, დაბადების თარიღი, ადგილი, პირადობის დამადასტურებელი
              დოკუმენტის სახე, მისი მონაცემები, ფოტოსურათი, პირადი ნომერი,
              ხელმოწერა, მოქალაქეობა - რეზიდენციის ქვეყანა, ფაქტობრივი და
              რეგისტრაციის მისამართი. საკონტაქტო მონაცემები: ტელეფონის ნომერი,
              ელექტრონული ფოსტის მისამართი, ფაქტობრივი და რეგისტრაციის
              მისამართი. სხვა ინფორმაცია: ოჯახური მდგომარეობა, ოჯახის წევრების
              მონაცემები, ინფორმაცია პირის გარდაცვალების თაობაზე და აღნიშნულთან
              დაკავშირებული შესაბამისი დოკუმენტაცია, საქმიანობა/პროფესია,
              შემოსავალი, სამუშაო ადგილი, თანამდებობა. საბანკო ანგარიშის ნომერი,
              ტექნიკური პასპორტი, ავტოტრანსპორტის მარკა, მოდელი, გამოშვების
              წელი, სახელმწიფო ნომერი, საიდენტიფიკაციო ნომერი, ინფორმაცია
              დასაზღვევი/დაზღვეული ობიექტის შესახებ, მართვის მოწმობის სერია,
              ტიპი, ნომერი, გაცემის თარიღი, ვიდეო გამოსახულება, სადაზღვევო
              შემთხვევის თარიღი და აღწერა, მიყენებული ზარალის ოდენობა. IP
              მისამართი, რომლის გამოყენებაც ხორციელდება ვებ-გვერდებზე და სადაც
              ხდება თქვენთვის შემოთავაზებული მომსახურების რეალიზაცია, Cookie -
              ფაილები, აპლიკაციის ლოგები, IMEI კოდი, მონაცემები ვებ-გვერდზე
              თქვენ მიერ განხორციელებული ქმედებების შესახებ, თქვენი
              ადგილმდებარეობის შესახებ ინფორმაცია (მოწყობილობის ტიპი, ბრაუზერი,
              რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა; თქვენ მიერ
              მოთხოვნილი დომენის სახელი; თქვენი ინტერნეტ-სერვისის პროვაიდერის
              (ISP) -კავშირის შესაბამისად, ხდება თქვენი ISP სახელის განსაზღვრა.
              ვებ-გვერდზე თქვენი ვიზიტის თარიღი და დრო; ვებ-გვერდზე თქვენი
              სესიის ხანგრძლიობა; ვებ-გვერდზე განხორციელებული ქმედებების შესახებ
              ინფორმაცია, მათ შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ
              ველი, მათი შევსების პროცესი და შესავსებად გამოყენებული დრო.
              გვერდები, რომლებიც ვებ-გვერდზე გახსენით მისით სარგებლობისას;
              თქვენი ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის
              განმავლობაში; იმ ფაილის URL, რომელსაც ნახულობთ, და მასთან
              დაკავშირებული ინფორმაცია; გვერდი, რომელმაც გადმოგამისამართათ ჩვენს
              ვებ-გვერდზე; საოპერაციო სისტემა, რომელსაც იყენებს თქვენი
              კომპიუტერი; ჩვენს ვებ-გვერდზე არსებულ „ტრაფიკზე“ თვალის მიდევნების
              მიზნით ვიყენებთ სხვადასხვა ანალიტიკურ მომსახურებას). გარდა ამისა,
              შესაბამისი სადაზღვევო მომსახურების გაწევის მიზნით კონკრეტულ
              სადაზღვევო პროდუქტებთან მიმართებით, როგორიცაა სიცოცხლისა და
              კრიტიკული დაავადებების დაზღვევა, სამოგზაურო დაზღვევა, ალდაგის მიერ
              შესაძლოა ასევე თქვენგან გამოთხოვილ და დამუშავებულ იქნეს ისეთი
              განსაკუთრებული კატეგორიის პერსონალური მონაცემები, რომლებიც
              დაკავშირებულია თქვენს ჯანმრთელობასთან, ფიზიკურ მდგომარეობასთან,
              მათ შორის: კონკრეტულ დაავადებებთან დაკავშირებით სიმპტომების
              არსებობა, გადატანილი/არსებული დაავადებები, ნარკოტიკული/ალკოჰოლური
              საშუალებების მოხმარება (სიხშირე). ასევე, ინფორმაცია ალდაგის მიერ
              თქვენთვის გაწეული მომსახურებისა და თქვენ მიერ ალდაგისაგან მიღებული
              პროდუქტების შესახებ, თქვენთან კომუნიკაციის შედეგად მოპოვებული
              მონაცემები და ნებისმიერი სხვა ინფორმაცია, რომლის დამუშავების
              ვალდებულება ალდაგს ეკისრება კანონმდებლობით. ჩვენ მიერ დამუშავებული
              მონაცემების შეგროვება აუცილებელია საკანონმდებლო თუ ხელშეკრულებით
              ნაკისრი ვალდებულებების უზრუნველსაყოფად და მოიცავს ასევე
              განსახორციელებელ და განხორციელებულ გადახდებს, გადახდის ფორმას
              (უნაღდო ანგარიშსწორების შემთხვევაში, საბანკო რეკვიზიტებს), თქვენს
              მიერ არჩეულ სადაზღვევო პაკეტს, დაფარვის ტერიტორიას, ლიმიტებს და
              სადაზღვევო პრემიის ოდენობას. მონაცემთა შეგროვებისას შეგატყობინებთ
              თუ რა მონაცემებია სავალდებულოდ მოსაწოდებელი და რა შედეგები
              შეიძლება დადგეს მათი მოუწოდებლობის შემთხვევაში. ჩვენ ინფორმაციას
              ვაგროვებთ უშუალოდ თქვენგან, როდესაც საკუთარი ნებით გვაწვდით
              მაგალითად, სადაზღვევო პროდუქტებით სარგებლობისთვის სადაზღვევო
              განაცხადის შევსების გზით. ასევე, ვაგროვებთ სხვა წყაროებიდანაც.
              მაგალითად, საჯარო წყაროებიდან, დაზღვევის ბროკერების, ჯანდაცვის
              დაწესებულებების, ფინანსური ინსტიტუტების მიერ მოწოდებული
              ინფორმაციის ფარგლებში.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              მონაცემთა დამუშავების მიზნები
            </h2>
            <p className="text-gray-600">
              „ალდაგში“ თქვენი პერსონალური მონაცემები შესაძლოა დამუშავდეს
              სხვადასხვა მიზნით, თუმცა მიზანი ყოველთვის არის კონკრეტული, მკაფიოდ
              განსაზღვრული და კანონიერი. „კომპანიაში“ თქვენი მონაცემები
              მუშავდება მხოლოდ იმ მოცულობით, რომელიც აუცილებელია კანონიერი
              მიზნის მისაღწევად და მხოლოდ იმ ვადით, რაც აუცილებელია, მონაცემების
              დამუშავების მიზნის მისაღწევად. თქვენი პერსონალური მონაცემები
              შესაძლოა დამუშავდეს შემდეგი მიზნით (აღნიშნული ჩამონათვალი არ არის
              ამომწურავი): კლიენტისათვის სადაზღვევო მომსახურების გაწევა და
              სახელშეკრულებო ვალდებულებების შესრულება; სადაზღვევო მომსახურების
              შეთავაზება, პირდაპირი მარკეტინგის განხორციელება, მომსახურების
              გაუმჯობესება, თქვენ მიერ ვალდებულებების შესრულების მონიტორინგის
              მიზნებისათვის; თქვენ მიერ ვებ-გვერდზე განხორციელებული ვიზიტის
              შესახებ ინფორმაციის შეგროვება, მათ შორის ვებ-გვერდზე თქვენი ქცევის
              შესასწავლად, თქვენ მიერ გაკეთებული არჩევანის დასამახსოვრებლად,
              მოძიებული ინფორმაციის ანალიზისათვისა და შემდგომში თქვენზე
              მორგებული/პერსონალური შეთავაზებების განსახორციელებლად; ვებ-გვერდზე
              არსებული სხვადსხვა საკომუნიკაციო საშუალებით ჩვენთვის დატოვებულ
              შეტყობინებებზე რეაგირების მიზნით; თქვენთვის საჭიროებისამებრ
              შეტყობინებების/კორეპონდენციების გადმოსაგზავნად; თქვენზე „ალდაგში“
              დაცული პერსონალური მონაცემების განახლება, შეცვლა; „კომპანიის“
              შესახებ სიახლეების გაცნობა, სხვადასხვა „ბენეფიტის“ (დამატებითი
              სარგებლის) შეთავაზება; სადაზღვევო შემთხვევის დადგენა, მისი
              მოცულობის განსაზღვრა; სადაზღვევო შემთხვევის შედეგად დამდგარი
              ზარალის რეგულირება; სადაზღვევო ანაზღაურების გაცემა; მზღვეველის
              სუბროგაციის უფლების გამოყენება; ადაზღვევო საქმიანობის აგენტის და
              ბროკერის მეშვეობით განხორციელება; თანამშრომელთა და მათი ოჯახის
              წევრების ჯანმრთელობის დაზღვევით უზრუნველყოფა; მონაცემთა
              დამუშავებაზე პასუხისმგებელი პირის, როგორც არასახელმწიფო საპენსიო
              სქემის დამფუძნებლის მიერ კანონმდებლობით ნაკისრი ვალდებულებების
              შესრულება; კანონმდებლობით დაკისრებული ვალდებულების შესრულება -
              კლიენტის, მესამე პირის, მინდობილი პირის იდენტიფიკაცია; ფულის
              გათეთრების, თაღლითობის და სხვა დანაშაულის პრევენცია და კონტროლი;
              ჩვენ მიერ განსაზღვრული სხვადსხვა მიზნებისათვის კვლევების
              განხორციელება, რეპორტების/ანგარიშების შედგენა; მომხმარებლებისთვის
              ავტო აუქციონის მომსახურების გაწევა; კომპანიის მიერ სამეწარმეო
              საქმიანობის განხორციელების დროს სხვადასხვა ხელშეკრულების
              გაფორმება; სახელშეკრულებო ურთიერთობების ფარგლებში ნაკისრი
              უფლება-მოვალეობების შესრულება; საჩივრების/პრეტენზიების განხილვა და
              მათზე რეაგირება; ჩვენი ზედამხედველი ორგანოსათვის და აუდიტორული
              კომპანიებისათვის მონაცემთა ხელმისაწვდომობის უზრუნველსაყოფად;
              კანონმდებლობით გათვალისწინებული ვალდებულებების შესრულება;
              პირდაპირი მარკეტინგის განხორციელება.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              მონაცემთა დამუშავების საფუძველი
            </h2>
            <p className="text-gray-600">
              „კომპანიაში“ თქვენი პერსონალური მონაცემები მუშავდება მხოლოდ
              შესაბამისი საფუძვლის არსებობის შემთხვევაში. მონაცემთა დამუშავების
              დროს შესაძლოა არსებობდეს ერთი ან ერთდროულად რამდენიმე საფუძველი.
              ჩვენ მიერ პერსონალური მონაცემების დამუშავება ხორციელდება შემდეგი
              საფუძვლების არსებობისას: არსებობს მონაცემთა სუბიექტის, თქვენი
              ნებაყოფლობითი თანხმობა მონაცემთა ერთი ან რამდენიმე კონკრეტული
              მიზნით დამუშავებაზე, რომელიც შესაძლოა გამოხატული იყოს, როგორც
              წერილობითი, ისე ზეპირი, სატელეკომუნიკაციო, ელექტრონული ან სხვა
              შესაბამისი ფორმით; მონაცემთა დამუშავება აუცილებელია მონაცემთა
              სუბიექტთან დადებული გარიგებით ნაკისრი ვალდებულების შესასრულებლად
              ან მონაცემთა სუბიექტის მოთხოვნით გარიგების დასადებად; მონაცემთა
              დამუშავება გათვალისწინებულია კანონით; მონაცემთა დამუშავება საჭიროა
              „ალდაგის“ მიერ მისთვის კანონმდებლობით დაკისრებული მოვალეობების
              შესასრულებლად; მონაცემები კანონმდებლობის თანახმად საჯაროდ
              ხელმისაწვდომია ან მონაცემთა სუბიექტმა იგი საჯაროდ ხელმისაწვდომი
              გახადა; მონაცემთა დამუშავება საჭიროა მონაცემთა სუბიექტის ან სხვა
              პირის სასიცოცხლო ინტერესების დასაცავად; მონაცემთა დამუშავება
              აუცილებელია მნიშვნელოვანი საჯარო ინტერესის დასაცავად; მონაცემთა
              დამუშავება აუცილებელია საქართველოს კანონმდებლობით განსაზღვრული
              საჯარო ინტერესის სფეროსათვის მიკუთვნებული ამოცანების
              შესასრულებლად; მონაცემთა დამუშავება აუცილებელია „ალდაგის“ ან
              მესამე პირის მნიშვნელოვანი ლეგიტიმური ინტერესების დასაცავად, გარდა
              იმ შემთხვევისა, თუ არსებობს მონაცემთა სუბიექტის (მათ შორის,
              არასრულწლოვანის) უფლებების დაცვის აღმატებული ინტერესი; მონაცემთა
              დამუშავება აუცილებელია კანონის შესაბამისად მნიშვნელოვანი საჯარო
              ინტერესის დასაცავად; მონაცემთა დამუშავება აუცილებელია მონაცემთა
              სუბიექტის განცხადების განსახილველად და მისთვის მომსახურების
              გასაწევად. თქვენი განსაკუთრებული კატეგორიის მონაცემთა დამუშავება
              ხდება მხოლოდ იმ პირობებში, რომ უზრუნველყოფილია თქვენი უფლებებისა
              და ინტერესების დაცვის საქართველოს კანონმდებლობით გათვალისწინებული
              გარანტიები და არსებობს მონაცემთა სუბიექტის წერილობითი თანხმობა
              ერთი ან რამდენიმე კონკრეტული მიზნით განსაკუთრებული კატეგორიის
              მონაცემთა დამუშავებაზე. გარდა აღნიშნულისა, თქვენი განსაკუთრებული
              მონაცემები ჩვენ მიერ შესაძლებელია დამუშავდეს იმ შემთხვევაში, თუ
              მათი დამუშავება პირდაპირ და სპეციალურად რეგულირდება კანონით და
              მათი დამუშავება არის აუცილებელი და პროპორციული ზომა დემოკრატიულ
              საზოგადოებაში, ასევე თუკი მათი დამუშავება აუცილებელია თქვენი ან
              სხვა პირის სასიცოცხლო ინტერესების დასაცავად და კანონმდებლობით
              გათვალისწინებულ სხვა შემთხვევებში.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              ავტომატიზებული გადაწყვეტილებები
            </h2>
            <p className="text-gray-600">
              სადაზღვევო რისკების შეფასებისას ან თაღლითობის პრევენციის მიზნით
              გასატარებელი ღონისძიებები შესაძლოა მოიცავდეს პროფილირებასაც, რაც
              გულისხმობს რომ შესაძლოა დავამუშაოთ თქვენს შესახებ ინფორმაცია
              პროგრამული უზრუნველყოფის მეშვეობით, რომელიც შეაფასებს თქვენს
              პერსონალურ ასპექტებს და წინასწარ განსაზღვრავს მოსალოდნელ რისკებსა
              და შესაძლო შედეგებს. ასევე შესაძლოა გამოვიყენოთ პროფილირება ან
              სხვაგვარად ჩავრთოთ ავტომატიზებული საშუალებები თქვენს შესახებ
              გადაწყვეტილების მისაღებად, რომლის საფუძველზეც გაწვდით დაზღვევის
              მომსახურებას. ამ შემთხვევაში სახეზეა „ავტომატიზებული ინდივიდუალური
              გადაწყვეტილების მიღება, რომელიც დასაშვებია მხოლოდ ამ ტიპის
              გადაწყვეტილების მისაღებად შესაბამისი საფუძვლის არსებობის
              შემთხვევაში. ჩვენ შეიძლება ამგვარი გადაწყვეტილებები მივიღოთ
              თქვენზე, როდესაც: გადაწყვეტილებები საჭიროა ხელშეკრულების
              დასადებად. მაგალითად, ჩვენ შეიძლება მივიღოთ გადაწყვეტილება
              თქვენთვის მორგებული დაზღვევის ტიპების შესახებ, სადაზღვევო პრემიის
              გამოსათვლელად თქვენი სადაზღვევო ისტორიიდან გამომდინარე ან სხვა
              ფინანსური ინფორმაციიდან გამომდინარე, ან საერთოდაც უარი გეთქვათ
              მომსახურებაზე. ამგვარი გადაწყვეტილებები გათვალისწინებულია კანონით
              ან კანონის საფუძველზე დელეგირებული უფლებამოსილების ფარგლებში
              გამოცემული კანონქვემდებარე ნორმატიული აქტით, მაგალითად, თაღლითობის
              პრევენციის მიზნებისთვის. გვაძლევთ თანხმობას ავტომატიზებული
              ინდივიდუალური გადაწყვეტილების მისაღებად. შეგიძლიათ დაგვიკავშირდეთ
              ავტომატიზებული ინდივიდუალური გადაწყვეტილების შესახებ დამატებითი
              ინფორმაციის მისაღებად. ასევე, უფლება გაქვთ უარი განაცხადოთ ან
              მოითხოვოთ ადამიანური რესურსის ჩართვა ავტომატიზებული ინდივიდუალური
              გადაწყვეტილების მიღების პროცესში.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              თქვენი მონაცემების მიმღები პირები
            </h2>
            <p className="text-gray-600">
              ჩვენ ვიღებთ ვალდებულებას დავიცვათ მიღებული ნებისმიერი სახის
              ინფორმაციის კონფიდენციალურობა და უსაფრთხოება. თუმცა, პერსონალური
              მონაცემების გადაცემა/გამჟღავნება მესამე პირებისთვის, შესაძლოა
              საჭირო გახდეს კანონმდებლობით პირდაპირ გათვალისწინებულ შეთხვევებში
              ან მომხმარებელთან გაფორმებული დაზღვევის ხელშეკრულებით
              გათვალისწინებულ ფარგლებში. აქედან გამომდინარე, ზოგიერთი კატეგორიის
              პერსონალური მონაცემების მიმღები შესაძლოა იყოს: სამართალდამცავი
              ორგანოები ან სხვა პირი, ზარალის თავიდან აცილებისა ან/და მისი
              დარეგულირებისა და ანაზღაურების მიზნით, ასევე კანონმდებლობით
              განსაზღვრული საჯარო ინტერესის სფეროში შემავალი ამოცანების (მათ
              შორის, დანაშაულის აცილების, დანაშაულის გამოძიების,
              სისხლისსამართლებრივი დევნის, მართლმსაჯულების განხორციელების და
              ა.შ.) შესასრულებლად; ნებისმიერი ადგილობრივი სახელმწიფო
              ორგანიზაციები/სამსახურები, კანონმდებლობით განსაზღვრული მოთხოვნების
              შესრულების მიზნით; სხვა პირი (ფიზიკური ან იურიდიული), რომელიც
              თქვენს პერსონალურ მონაცემებს ამუშავებს „ალდაგისთვის“ ან მისი
              სახელით, მხოლოდ იმ შემთხვევაში, თუ „ალდაგს“ გაფორმებული აქვს
              დამუშავებაზე უფლებამოსილ პირთან შესაბამისი წერილობითი
              ხელშეკრულება. ხელშეკრულების გაფორმებამდე „ალდაგი“ ყოველთვის
              წინასწარ რწმუნდება მხარის სანდოობაში და ხელშეკრულებით
              ითვალისწინებს დამუშავებაზე უფლებამოსილი პირის ვალდებულებას,
              უზრუნველყოს ისეთი ორგანიზაციული და ტექნიკური ზომები, რაც დაიცავს
              თქვენს მონაცემებს, ხოლო ხელშეკრულების გაფორმების შემდეგ
              მონიტორინგს უწევს დამუშავებაზე უფლებამოსილი პირის მიერ მისი
              ვალდებულებების შესრულების პროცესს - მისი წარმომადგენლების
              მეშვეობით ამოწმებს დამუშავებაზე უფლებამოსილი პირის სამუშაო ადგილს,
              სადაც ხორციელდება თქვენი პერსონალური მონაცემების დამუშავება და
              ადგილზე ახორციელებს ინსპექტირებას მონაცემთა უსაფრთხოებისთვის
              გატარებული ღონისძიებების შემოწმების მიზნით. აღნიშნული
              ვალდებულებების დარღვევისთვის „ალდაგსა“ და დამუშავებაზე უფლებამოსილ
              პირს შორის გაფორმებული ხელშეკრულებები ითვალისწინებს სანქციებს.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">მონაცემთა შენახვის ვადა</h2>
            <p className="text-gray-600">
              მონაცემები შეინახება თქვენი მომსახურების მთელი პერიოდის
              განმავლობაში, იმ ვადით, რაც საჭიროა ზემოთ ჩამოთვლილი მიზნების
              მისაღწევად, მათ შორის, თქვენთან სადაზღვევო მომსახურების შეწყვეტის
              შემდგომაც, თუ ეს საჭიროა კანონმდებლობით გათვალისწინებული
              ვალდებულებების შესასრულებლად.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              კონფიდენციალობის გარანტიები
            </h2>
            <p className="text-gray-600">
              ალდაგი უზრუნველვყოფს მოწოდებული ინფორმაციის მაქსიმალურ დაცულობას
              კანონმდებლობით დადგენილი წესით. ჩვენ ვზრუნავთ თქვენი ინფორმაციის
              უსაფრთხოებასა და კონფიდენციალურობაზე, თუმცა, ვიხსნით
              პასუხისმგებლობას მესამე პირების მიერ ინფორმაციის არასანქცირებულ
              წვდომაზე ამ მონაცემების კომპანიისთვის მოწოდების დროს (მათ შორის,
              ინფორმაციის დისტანციურად მოწოდებისას). თქვენ პასუხისმგებლობას
              იღებთ მოწოდებული ინფორმაციის სიზუსტეზე. თქვენი მონაცემების
              ცვლილებების შემთხვევაში, შეგიძლიათ გვაცნობოთ აღნიშნულის თაობაზე და
              შეძლებისდაგვარად მყისიერად, თუმცა, არაუგვიანეს 10 დღისა მოვახდენთ
              რეაგირებას და ავსახავთ ცვლილებებს შესაბამის მონაცემთა ბაზებში.
              ალდაგი იღებს სათანადო უსაფრთხოების ზომებს, რათა დაიცვას მისი
              კონტროლის ქვეშ არსებული მონაცემები არაუფლებამოსილი წვდომისგან,
              მათი უკანონო გამოყენებისგან და გამჟღავნებისგან, განადგურებისგან ან
              შემთხვევითი დაკარგვისგან. კომპანია უზრუნველვყოფს ასევე
              უსაფრთხოების სათანადო ზომებისა და პროცედურების არსებობას, მას
              გააჩნია დოკუმენტირებული ინფორმაციული უსაფრთხოების პროგრამა და
              ინფორმაციული უსაფრთხოების პოლიტიკა, სადაც განსაზღვრულია
              მმართველობითი, ტექნიკური, საოპერაციო და ფიზიკური უსაფრთხოების
              კონტროლის ღონისძიებები, რომლებიც შეგროვებული ინფორმაციისა და ჩვენი
              ბიზნესის თავისებურებების თანაბარზომიერია. ჩვენ გულისხმიერად
              ვეკიდებით თქვენი კონფიდენციალურობისა და მონაცემთა დაცვის უფლებებს
              და წინამდებარე პოლიტიკით განსაზღვრული შემთხვევების გარდა, თქვენ
              მონაცემებს გავამჟღავნებთ მხოლოდ იმ შემთხვევაში თუ ამას მოითხოვს
              კანონი, საზედამხედველო, მარეგულირებელი ან/და სამართალდამცავი
              ორგანოები, ან/და საკუთარი უფლებების ან სხვათა უფლებების დასაცავად
              და კანონმდებლობით გათვალისწინებულ სხვა შემთხვევებში.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              თქვენი მონაცემთა დაცვის უფლებები
            </h2>
            <p className="text-gray-600">
              თქვენ, გაქვთ შესაძლებლობა ისარგებლოთ კანონმდებლობით მონიჭებული
              ყველაუფლებამოსილებით. მათ შორის: მონაცემთა დამუშავების შესახებ
              ინფორმაციის მიღების უფლება თქვენ გაქვთ უფლება, ჩვენ და
              დამუშავებაზე უფლებამოსილ პირს მოსთხოვოთ იმის დადასტურება,
              მუშავდება თუ არა თქვენ შესახებ მონაცემები, დასაბუთებულია თუ არა
              მონაცემთა დამუშავება და მოთხოვნის შესაბამისად უსასყიდლოდ მიიღოთ
              შემდეგი ინფორმაცია: ა) თქვენ შესახებ იმ მონაცემის თაობაზე, რომელიც
              მუშავდება, აგრეთვე ამ მონაცემის დამუშავების საფუძვლისა და მიზნის
              შესახებ; ბ) მონაცემთა შეგროვების/მოპოვების წყაროს შესახებ; გ)
              მონაცემთა შენახვის ვადის (დროის) შესახებ, ხოლო თუ კონკრეტული ვადის
              განსაზღვრა შეუძლებელია, ვადის განსაზღვრის კრიტერიუმების თაობაზე;
              დ) მონაცემთა სუბიექტის ამ თავით გათვალისწინებული უფლებების
              შესახებ; ე)მონაცემთა გადაცემის სამართლებრივი საფუძვლისა და
              მიზნების, აგრეთვე მონაცემთა დაცვის სათანადო გარანტიების შესახებ,
              თუ მონაცემები გადაეცემა სხვა სახელმწიფოს ან საერთაშორისო
              ორგანიზაციას; ვ) მონაცემთა მიმღების ვინაობის ან მონაცემთა
              მიმღებების კატეგორიების შესახებ, მათ შორის, ინფორმაცია მონაცემთა
              გადაცემის საფუძვლისა და მიზნის თაობაზე, თუ მონაცემები მესამე პირს
              გადაეცემა; ზ) ავტომატიზებული დამუშავების, მათ შორის, პროფაილინგის
              შედეგად მიღებული გადაწყვეტილების და იმ ლოგიკის შესახებ, რომელიც
              გამოიყენება ამგვარი გადაწყვეტილების მისაღებად, აგრეთვე მონაცემთა
              დამუშავებაზე მისი გავლენისა და დამუშავების მოსალოდნელი/სავარაუდო
              შედეგის თაობაზე. მონაცემთა გაცნობისა და ასლის მიღების უფლება
              თქვენ, როგორც მონაცემთა სუბიექტს უფლება გაქვთ, ჩვენთან და
              დამუშავებაზე უფლებამოსილ პირთან გაეცნოთ თქვენ შესახებ არსებულ
              პერსონალურ მონაცემებს და უსასყიდლოდ მიიღოთ ამ მონაცემების ასლები,
              გარდა კანონმდებლობით გათვალისწინებული გამონაკლისებისა. მონაცემთა
              გასწორების, განახლებისა და შევსების უფლება თქვენ უფლება გაქვთ,
              ჩვენ და დამუშავებაზე უფლებამოსილ პირს მოგვთხოვოთ თქვენ შესახებ
              მცდარი, არაზუსტი ან/და არასრული მონაცემების გასწორება, განახლება
              ან/და შევსება. მონაცემთა დამუშავების შეწყვეტის, წაშლის ან
              განადგურების უფლება თქვენ უფლება გაქვთ, ჩვენ და დამუშავებაზე
              უფლებამოსილ პირს მოსთხოვოთ თქვენ შესახებ მონაცემთა დამუშავების
              (მათ შორის, პროფაილინგის) შეწყვეტა, წაშლა ან განადგურება.
              მონაცემთა დაბლოკვის უფლება თქვენ, როგორც მონაცემთა სუბიექტს უფლება
              გაქვთ, ჩვენ და დამუშავებაზე უფლებამოსილ პირს მოსთხოვოთ მონაცემთა
              დაბლოკვა, თუ არსებობს ერთ-ერთი შემდეგი გარემოება: ა) სადავოდ ხდით
              მონაცემების ნამდვილობას ან სიზუსტეს; ბ) მონაცემთა დამუშავება
              უკანონოა, თუმცა ეწინააღმდეგებით მათ წაშლას და ითხოვს მონაცემთა
              დაბლოკვას; გ) მონაცემები საჭირო აღარ არის მათი დამუშავების მიზნის
              მისაღწევად, თუმცა თქვენ ისინი გჭირდებათ საჩივრის/სარჩელის
              წარსადგენად; დ) თქვენ მოითხოვეთ მონაცემთა დამუშავების შეწყვეტა,
              წაშლა ან განადგურება და მიმდინარეობს ამ მოთხოვნის განხილვა; ე)
              არსებობს მონაცემების მტკიცებულებად გამოყენების მიზნით შენახვის
              აუცილებლობა. მონაცემთა გადატანის უფლება კანონმდებლობით
              გათვალისწინებული საფუძვლებით მონაცემთა ავტომატური დამუშავების
              შემთხვევაში, თუ ეს ჩვენი მხრიდან ტექნიკურად შესაძლებელია, უფლება
              გაქვთ, ჩვენგან და დამუშავებაზე უფლებამოსილი პირისგან
              სტრუქტურიზებული, საზოგადოდ გამოყენებადი და მანქანურად წაკითხვადი
              ფორმატით მიიღოთ თქვენ მიერ მოწოდებული მონაცემები ან მოითხოვოთ ამ
              მონაცემთა სხვა დამუშავებისთვის პასუხისმგებელი პირისთვის გადაცემა.
              ავტომატიზებული ინდივიდუალური გადაწყვეტილების მიღება და მასთან
              დაკავშირებული უფლებები თქვენ უფლება გაქვთ, არ დაექვემდებაროთ
              მხოლოდ ავტომატიზებულად, მათ შორის, პროფაილინგის საფუძველზე,
              მიღებულ გადაწყვეტილებას, რომელიც თქვენთვის წარმოშობს სამართლებრივ
              ან სხვა სახის არსებითი მნიშვნელობის მქონე შედეგს, გარდა
              კანონმდებლობით გათვალისწინებული შემთხვევებისა. თანხმობის
              გამოხმობის უფლება თქვენ უფლება გაქვთ, ნებისმიერ დროს, ყოველგვარი
              განმარტების ან დასაბუთების გარეშე გამოიხმოთ თქვენ მიერ გაცემული
              თანხმობა პერსონალური მონაცემების დამუშავების თაობაზე. ამ
              შემთხვევაში, თქვენი მოთხოვნის შესაბამისად, ჩვენ შევწყვეტთ
              მონაცემთა დამუშავებას ან/და წავშლით ან გავანადგურებთ დამუშავებულ
              მონაცემებს კანონმდებლობით დადგენილ ვადებში, თუ მონაცემთა
              დამუშავების სხვა საფუძველი არ იარსებებს. თქვენ უფლება გაქვთ,
              თანხმობა გამოიხმოთ იმავე ფორმით, რომლითაც თანხმობა განაცხადეთ.
              ამასთან, აღნიშნულის განხორციელება ასევე შეგიძლიათ ჩვენს იურიდიულ
              მისამართზე წერილობითი შეტყობინების გამოგზავნის, ჩვენს ტელეფონის
              ნომერზე (+995 322 444 999) დაკავშირებით, ჩვენს ელექტრონულ
              მისამართზე: personaldata@aldagi.ge ელექტრონული შეტყობინების
              გამოგზავნის ან ჩვენს ნებისმიერ ოფისში მოთხოვნის გაცხადების გზით.
              თქვენ უფლება გაქვთ თანხმობის გამოხმობამდე მოგვთხოვოთ და მიიღოთ
              ინფორმაცია თანხმობის გამოხმობის შესაძლო შედეგების შესახებ. გთხოვთ
              გაითვალისწინოთ, რომ ზემოაღნიშნული უფლებების რეალიზებისთვის ჩვენ
              მოვახედენთ თქვენს იდენტიფიკაციას, რათა დავრწმუნდეთ, რომ
              პერსონალური მონაცემების შემცველი ინფორმაცია მიეწოდება მონაცემთა
              სუბიექტს ან ამისთვის სათანადოდ უფლებამოსილ პირს. გასაჩივრების
              უფლება თქვენ უფლება გაქვთ, „პერსონალურ მონაცემთა დაცვის შესახებ“
              საქართველოს კანონმდებლობით დადგენილი უფლებებისა და წესების
              დარღვევის შემთხვევაში კანონით დადგენილი წესით მიმართოთ პერსონალურ
              მონაცემთა დაცვის სამსახურს, სასამართლოს ან/და ზემდგომ
              ადმინისტრაციულ ორგანოს. ამასთან, ჩვენი ქმედების გასაჩივრების
              უფლებამოსილება გაქვთ ჩვენს ოფიციალურ ელექტრონულ მისამართზე:
              personaldata@aldagi.ge -ზე. პირდაპირი მარკეტინგის მიზნით
              გაცხადებული თანხმობის გამოხმობის უფლება თქვენ ასევე გაქვთ უფლება
              გამოიხმოთ პირდაპირი მარკეტინგის მიზნით გაცხადებული თანხმობა
              ნებისმიერ დროს, ყოველგვარი საფასურის გადახდის გარეშე იმავე ფორმით,
              რომლითაც პირდაპირი მარკეტინგი ხორციელდება თქვენ მიმართ. ასევე,
              საჭიროების შემთხვევაში, თანხმობის გამოხმობის უფლება გაქვთ ჩვენს
              ტელეფონის ნომერზე (+995 322 444 999) დარეკვის, ჩვენს ელექტრონულ
              მისამართზე: personaldata@aldagi.ge ელექტრონული შეტყობინების
              გამოგზავნის ან ჩვენს ნებისმიერ ოფისში მოთხოვნის გაცხადების გზით.
              ზემოაღნიშნული უფლებები არააბსოლუტურია და შესაძლოა შეიზღუდოს
              კანონმდებლობით გათვალისწინებულ შემთხვევებში. ცვლილებები მონაცემთა
              დაცვის პოლიტიკაში უფლებას ვიტოვებთ ნებისმიერ დროს განვაახლოთ
              პოლიტიკა. თქვენი პერსონალური მონაცემების დამუშავებაში ან პოლიტიკის
              არსებითი ცვლილებების შემთხვევაში, გექნებათ საშუალება გაეცნოთ
              შეცვლილ პირობებს. ეს პოლიტიკა ვრცელდება ყველა ინფორმაციაზე,
              რომელსაც ვებგვერდის მეშვეობით ვამუშავებთ თქვენს შესახებ.
            </p>
          </section>

          <section ref={marketingTermsRef} className="space-y-3">
            <h2 className="text-xl font-semibold">
              პირდაპირი მარკეტინგის დათქმა
            </h2>
            <p className="text-blue-600">
              ინფორმირებული თანხმობა პირდაპირი მარკეტინგის მიზნით მონაცემთა
              დამუშავების შესახებ
            </p>

            <p className="text-gray-600">
              თქვენ, როგორც მომხმარებელი, პირდაპირი მარკეტინგის მიზნით მონაცემთა
              დამუშავებაზე თანხმობის გამოხატვის შემთხვევაში, ადასტურებთ, რომ:
              გაეცანით სს „სადაზღვევო კომპანია ალდაგის“ (ს.ნ 404476189)
              (შემდგომში - „მზღვეველი“) კონფიდენციალურობის პოლიტიკას
              https://aldagi.ge/privacy-policy და ეთანხმებით, რომ მზღვეველმა
              პირდაპირი მარკეტინგის მიზნით (საქონლის, იდეის, მომსახურების,
              სამუშაოს ან/და წამოწყების, შეთავაზება ან აღნიშნულის თაობაზე
              ინფორმირება) დაამუშაოს (სარეკლამო ხასიათის შეტყობინებების გაგზავნა
              ტელეფონის, ფოსტის, ელექტრონული ფოსტის ან სხვა ელექტრონული
              საშუალებით) თქვენი პერსონალური მონაცემები (სახელი, გვარი,
              მისამართი, ტელეფონის ნომერი და ელექტრონული ფოსტის მისამართი),
              ასევე ამავე მიზნით გადასცეს აღნიშნული მონაცემები დაკავშირებულ
              (აფილირებულ) შემდეგ კომპანიებს: სს „სადაზღვევო კომპანია ტაო“ (ს.ნ
              202408386), სს „სადაზღვევო კომპანია იმედი ელ“ (ს.ნ 204919008), სს
              „გრინვეი საქართველო“ (ს.ნ 404867006), შპს „ამბოლი“ (ს.ნ
              216402701), სს „არდი დაზღვევა“ (ს.ნ 405662242) და ისინი, რომელთა
              წილების/აქციების 50%-ის ან მეტის პირდაპირ ან არაპირდაპირ მფლობელს
              წარმოადგენს სს „საქართველოს კაპიტალი" (ს.ნ 404549690)); თქვენთვის
              ცნობილია, რომ პირდაპირი მარკეტინგის მიზნით მონაცემების
              დამუშავებაზე თანხმობა არ არის სავალდებულო და თანხმობის გაუცემლობა
              ან შემდგომ გამოხმობა არ გამოიწვევს თქვენთვის ძირითადი მომსახურების
              შეწყვეტას/მომსახურებაზე უარის თქმას. ამასთან, გაქვთ უფლება,
              ნებისმიერ დროს მოითხოვოთ პირდაპირი მარკეტინგის მიზნით მონაცემთა
              დამუშავების შეწყვეტა, ხოლო მზღვეველი უზრუნველყოფს ამ მოთხოვნის
              რეალიზებას სრულიად უფასოდ, იმავე ფორმით, რომლითაც პირდაპირი
              მარკეტინგი განხორციელდება. თანხმობის გამოხმობა, მათ შორის,
              შეგიძლიათ ტელეფონის ნომერზე (+995 322 444 999), ელ. ფოსტის
              მისამართზე (personaldata@aldagi.ge) ან მზღვეველის ნებისმიერ ოფისში
              მოთხოვნის გაცხადების გზით, როგორც უშუალოდ მზღვეველის, ისე
              აფილირებული პირების მიერ მონაცემთა დამუშავების შეწყვეტის მიზნით.
            </p>
          </section>

          <section className="space-y-3">
            <h2 className="text-xl font-semibold">
              "მზა ჩანაწერების" განაცხადი
            </h2>
            <p className="text-gray-600">
              რა არის ე.წ. „მზა ჩანაწერები“ („Cookies“) „მზა ჩანაწერები“ არის
              მცირე მოცულობის ინფორმაციის შემცველი ტექსტური ფაილები, რომელსაც
              თქვენი კომპიუტერი, ტელეფონი, ან პლანშეტი ბრაუზერის მეშვეობით
              ინახავს ჩვენს ვებგვერდზე ან ჩვენს სხვა დისტანციურ პლატფორმებზე
              ვიზიტისას. „მზა ჩანაწერების“ სახეები და მათი დამუშავების მიზანი
              ჩვენ მიერ გამოიყენება როგორც „სავალდებულო/აუცილებელი“, ასევე
              „არასავალდებულო“ „მზა ჩანაწერები“. „მზა ჩანაწერების“ გამოყენებას
              მრავალი სხვადასხვა დანიშნულება აქვს, საერთო ჯამში კი, მათი
              გამოყენება ემსახურება ჩვენი სერვისით სარგებლობისას თქვენი
              გამოცდილების გამარტივებასა და გაუმჯობესებას, სერვისით სარგებლობის
              შესახებ ანალიტიკური/მარკეტინგული ინფორმაციის მოპოვებას და ასევე,
              უსაფრთხოების დაცვის მიზანს. „სავალდებულო“ „მზა ჩანაწერების“
              გამოყენება აუცილებელია ვებგვერდის/პლატფორმის ფუნქციონირებისა და
              მასში ოპერირებისთვის. „სავალდებულო“ „მზა ჩანაწერები“ მუშავდება
              ჩვენს ვებგვერდზე/პლატფორმაზე ყოველი ვიზიტის ფარგლებში, ვინაიდან,
              აღნიშნულის გარეშე ჩვენი ონლაინ სერვისებით სარგებლობა ტექნიკურად
              შესაძლებელი არ იქნება. რაც შეეხება „არასავალდებულო“ „მზა
              ჩანაწერებს“, ჩვენ მიერ გამოყენებული „არასავალდებულო“ მზა
              ჩანაწერები და მათი გამოყენების მიზნები შემდეგია: ა) ანალიტიკური -
              უზრუნველყოფს მომხმარებლის ქცევის შესწავლას ანალიტიკური ჩანაწერების
              შეგროვებისა და დამუშავების გზით. მათი მეშვეობით ვსწავლობთ,
              ვებ-გვერდის რომელ ნაწილთან აქვს უფრო ხშირი შეხება მომხმარებელს და
              რითია მეტად დაინტერესებული. ბ) ფუნქციური - მათი მეშვეობით
              ვიმახსოვრებთ ვებ-გვერდის მოხმარებისას მომხმარებლების მიერ
              გაკეთებულ არჩევანს რათა სამომავლოდ მათი გამოცდილება გაუმჯობესებულ
              და გამარტივებულ იქნას. გ) პირად ელექტრონულ ფოსტასთან დაკავშირებული
              „მზა ჩანაწერები“ - ვებ-გვერდი მომხმარებელს აძლევს შესაძლებლობას
              დაარეგისტრიროს საკუთარი ელექტრონული ფოსტის მისამართი და ამ გზით
              გამოიწეროს ჩვენი სიახლეები. ამ „მზა ჩანაწერებმა“ შესაძლოა
              მომხმარებელს შეახსენოს თავისი ელექტრონული ფოსტის დარეგისტრირების
              შესაძლებლობის შესახებ. დ) მესამე მხარის „მზა ჩანაწერები“ -
              აღნიშნული წარმოადგენს იმგვარ ფაილებს, რომლებიც გამოიყენება
              მარკეტინგული და ანალიტიკური მიზნებისათვის და მათი შეგროვება ხდება
              სხვადასხვა სანდო გვერდიდან. ე) „მზა ჩანაწერები“ ვებ-გვერდის
              პარამეტრების შესახებ - აღნიშნული ფაილები გამოიყენება იმ
              შემთხვევაში, როდესაც მომხმარებელი სარგებლობს ვებ-გვერდით და მას
              ვებ-გვერდის მომსახურება შეფერხებებით მიეწოდება მისი პარამეტრების
              „ბრალეულობით.“ რა ინფორმაციას ვამუშავებთ თქვენ შესახებ „მზა
              ჩანაწერების“ მეშვეობით და რა ვადით ვებგვერდზე ვიზიტისას გროვდება
              შემდეგი ინფორმაცია: ა) თქვენი IP მისამართი; ბ) თქვენი მოწყობილობის
              ტიპი და ბრაუზერი, რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა;
              გ) თქვენ მიერ მოთხოვნილი დომენის სახელი; დ) თქვენი
              ინტერნეტ-სერვისის პროვაიდერის სახელი; ე) ვებ-გვერდზე თქვენი
              ვიზიტის თარიღი და დრო; ვ) ვებ-გვერდზე თქვენი სესიის ხანგრძლივობა;
              ზ) ვებ-გვერდზე განხორციელებული ქმედებების შესახებ ინფორმაცია, მათ
              შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ ველი, მათი
              შევსების პროცესი და შესავსებად გამოყენებული დრო; თ) გვერდები,
              რომლებიც ვებ-გვერდზე გახსენით მისით სარგებლობისას; ი) თქვენი
              ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის
              განმავლობაში; კ) თქვენ მიერ გახსნილი ფაილის URL (Uniform Resource
              Locator - ერთიანი რესურსების ლოკატორი) და მასთან დაკავშირებული
              ინფორმაცია; ლ) გვერდი, რომელმაც გადმოგამისამართათ ჩვენს
              ვებ-გვერდზე; მ) საოპერაციო სისტემა, რომელსაც იყენებს თქვენი
              მოწყობილობა; ნ) ჩვენს ვებ-გვერდზე არსებულ „ტრაფიკზე“ თვალის
              მიდევნების მიზნით სხვადასხვა ანალიტიკური მომსახურების ფარგლებში
              მოგროვებული ინფორმაცია. ზემოაღნიშნულ მონაცემებს ვინახავთ არაუმეტეს
              1 (ერთი) წლის ვადით. მონაცემთა სუბიექტის უფლებები და „მზა
              ჩანაწერების“ გამოყენების მართვა ვებგვერდზე შესვლისას მონაცემთა
              სუბიექტს ეძლევა შესაძლებლობა გაეცნოს „მზა ჩანაწერების“ პოლიტიკას
              და დაეთანხმოს მათ გამოყენებას „თანხმობის“ ღილაკზე დაჭერით. თუკი
              ვებგვერდის მომხმარებლის მიერ არ დაფიქსირდება/მოინიშნება
              „თანხმობა“, ვებგვერდის გამოყენების გაგრძელება მის მიერ
              ზემოაღნიშნულზე თანხმობად ჩაითვლება. ხაზგასასმელია, რომ
              „სავალდებულო“ „მზა ჩანაწერების“ გათიშვა/დაბლოკვა შეუძლებელია,
              ვინაიდან მათი არსებობა აუცილებლობას წარმოადგენს ვებგვერდის
              ფუნქციონირებისათვის. თუკი თქვენ არ გსურთ რომ ჩვენ მიერ
              გამოყენებული იქნეს „სავალდებულო“ „მზა ჩანაწერები“, არ გააგრძელოთ
              ვებგვერდით სარგებლობა და მიმართეთ ალტერნატიულ საშუალებებს. რაც
              შეეხება „არასავალდებულო“ „მზა ჩანაწერებს“, მომხმარებელს აქვს
              შესაძლებლობა სურვილის შესაბამისად შეზღუდოს ან დაბლოკოს ისინი
              შესაბამისი ბრაუზერის პარამეტრების გამოყენებით. ქვემოთ შეგიძლიათ
              იხილოთ ყველაზე გავრცელებული ბრაუზერების მეშვეობით, „მზა
              ჩანაწერების“ მართვის გზები: Google Chrome -
              https://support.google.com/accounts/answer/61416?co=GENIE.Platform%3DDesktop&hl=en
              Microsoft Edge -
              https://support.microsoft.com/en-us/windows/microsoft-edge-browsing-data-and-privacy-bb8174ba-9d73-dcf2-9b4a-c582b4e640dd
              Mozilla Firefox -
              https://support.mozilla.org/en-US/kb/enhanced-tracking-protection-firefox-desktop?redirectslug=enable-and-disable-cookies-website-preferences&redirectlocale=en-US
              Microsoft Internet Explorer -
              https://support.microsoft.com/en-gb/windows/manage-cookies-in-microsoft-edge-view-allow-block-delete-and-use-168dab11-0753-043d-7c16-ede5947fc64d
              Opera - https://help.opera.com/en/latest/web-preferences/ Apple
              Safari - https://support.apple.com/en-gb/safari სხვა ბრაუზერების
              გამოყენების შემთხვევაში, „მზა ჩანაწერების“ მართვის საშუალებებზე
              ინფორმაციის მოსაპოვებლად შეგიძლიათ მიმართოთ შესაბამისი ბრაუზერის
              ოფიციალურ ვებგვერდს. თქვენ ასევე შეგიძლიათ უარი თქვათ Google
              Analytics მიერ თქვენი მონაცემების შეგროვებაზე და ასეთ შემთხვევაში,
              ამ ინფორმაციას ვერ გამოიყენებს ვერცერთი ვებგვერდი, რომლითაც
              ისარგებლებთ. ამისთვის საჭირო ინფორმაცია შეგძლიათ იხილოთ ბმულზე -
              http://tools.google.com/dlpage/gaoptout. როგორც ზემოთ აღინიშნა,
              „მზა ჩანაწერები“ მნიშვნელოვანია ვებ-გვერდის ეფექტური
              ფუნქციონირებისათვის და თქვენ მიერ ვებ-გვერდზე ოპერირებისას
              საუკეთესო გამოცდილების მისაღებად. შესაბამისად, ზემოაღნიშნული წესით
              მათი დაბლოკვის/გათიშვის შემთხვევაში, თქვენი გამოცდილება
              ვებ-გვერდის მოხმარებისას შესაძლოა შეიცვალოს და გაუარესდეს.
              მაგალითად, გქონდეთ შეფერხებები გარკვეულ გვერდებზე გადასვლისას, ან
              ვერ გამოიყენოთ ვებგვერდზე ჩაშენებული გარკვეული სერვისები.{" "}
            </p>
          </section>
        </div>
      </div>
    </>
  );
};

export default TermsConditions;
