// "use client";
// import React, { useEffect, useRef } from "react";
// import { useSearchParams } from "next/navigation";
// import Header5 from "@/components/headers/Header5";
// import MobileHeader1 from "@/components/headers/MobailHeader1";

// const TermsConditions = () => {
//   const searchParams = useSearchParams();
//   const marketingTermsRef = useRef(null);

//   useEffect(() => {
//     if (searchParams.get("section") === "marketing") {
//       setTimeout(() => {
//         marketingTermsRef.current?.scrollIntoView({ behavior: "smooth" });
//       }, 100);
//     }
//   }, [searchParams]);

//   return (
//     <>
//       <div className="max-w-4xl mx-auto p-6 space-y-8 mt-[80px]">
//         <h1 className="text-2xl font-bold">კონფიდენციალურობის განაცხადი</h1>
//         <p className="text-gray-600">
//           სს „სადაზღვევო კომპანია ალდაგი“ პატივს სცემს თქვენი პირადი ცხოვრებისა
//           და პერსონალურ მონაცემთა დაცვის უფლებებს. ჩვენთვის პრიორიტეტულია,
//           პერსონალური მონაცემები დავამუშაოთ კონფიდენციალურობის დაცვის საუკეთესო
//           პრაქტიკისა და მოქმედი კანონმდებლობის შესაბამისად. ამ განაცხადში
//           აღწერილია ვებგვერდის - www.aldagi.ge მეშვეობით, თქვენი პერსონალური
//           მონაცემების დამუშავების პროცესი და წარმოდგენილია თქვენი მონაცემთა
//           დაცვის უფლებები და მათი რეალიზების მექანიზმები. განაცხადში გამოყენებულ
//           ტერმინებს აქვთ „პერსონალურ მონაცემთა დაცვის შესახებ“ საქართველოს
//           კანონით და სხვა ნორმატიული აქტებით განსაზღვრული მნიშვნელობა.
//         </p>

//         <div className="space-y-6">
//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               ვინ არის პასუხისმგებელი თქვენი მონაცემების დამუშავებაზე?
//             </h2>
//             <p className="text-gray-600">
//               კომპანიის სრული სახელწოდება და პროფილი: სს „სადაზღვევო
//               კომპანიაალდაგი“, ს/ნ: 404476189 (შემდეგში „ჩვენ“, „ალდაგი“ ან/და
//               „კომპანია“) - საქართველოს კანონმდებლობის შესაბამისად შექმნილი,
//               ლიცენზირებულისადაზღვევო კომპანიაა. მისი ძირითადი საქმიანობაა
//               სადაზღვევო მომსახურების გაწევა სხვადასხვა სფეროში, კერძოდ: ავტო,
//               ქონების, აგრო, სიცოცხლისა და კრიტიკული დაავადებების, პროფესიული
//               პასუხისმგებლობის, ტვირთების, სამოგზაურო დაზღვევა და სხვა. ალდაგი
//               მოქმედებს როგორც მონაცემთა დამუშავებისთვის პასუხისმგებლი პირი.
//               მისამართი და საკონტაქტო მონაცემები: ანა პოლიტკოვსკაიას ქუჩა №16.
//               0186, თბილისი, საქართველო; ტელ: +995 322 444 999; ელ.ფოსტა:
//               info@aldagi.ge. პერსონალურ მონაცემთა დაცვის ოფიცერი: შპს “Privacy
//               Professionals“ (ს/ნ: 405682916); ტელ.: 577 070 591; 599 900 215;
//               ელ. ფოსტა: privacyprofessionalsgeo@gmail.com.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">რა მონაცემებს ვამუშავებთ?</h2>
//             <p className="text-gray-600">
//               ჩვენ, როგორც სადაზღვევო კომპანიას, საქართველოს მოქმედი
//               კანონმდებლობის შესაბამისად, გვესაჭიროება ინფორმაცია დაზღვევის
//               ხელშეკრულების გასაფორმებლად და აღნიშნულ ინფორმაციას ჩვენ ვღებულობთ
//               უშუალოდ თქვენგან. ამგვარი მონაცემები როგორც წესი, არ არის საჯაროდ
//               ხელმისაწვდომი. კომპანიის მიერ დამუშავებული მონაცემების კატეგორია
//               დამოკიდებულია შემოთავაზებული დაზღვევის ტიპზე და შესაძლოა მოიცავდეს
//               ქვემოთ ჩამოთვლილს: მაიდენტიფიცირებელი მონაცემები: სახელი, გვარი,
//               ასაკი, სქესი, დაბადების თარიღი, ადგილი, პირადობის დამადასტურებელი
//               დოკუმენტის სახე, მისი მონაცემები, ფოტოსურათი, პირადი ნომერი,
//               ხელმოწერა, მოქალაქეობა - რეზიდენციის ქვეყანა, ფაქტობრივი და
//               რეგისტრაციის მისამართი. საკონტაქტო მონაცემები: ტელეფონის ნომერი,
//               ელექტრონული ფოსტის მისამართი, ფაქტობრივი და რეგისტრაციის
//               მისამართი. სხვა ინფორმაცია: ოჯახური მდგომარეობა, ოჯახის წევრების
//               მონაცემები, ინფორმაცია პირის გარდაცვალების თაობაზე და აღნიშნულთან
//               დაკავშირებული შესაბამისი დოკუმენტაცია, საქმიანობა/პროფესია,
//               შემოსავალი, სამუშაო ადგილი, თანამდებობა. საბანკო ანგარიშის ნომერი,
//               ტექნიკური პასპორტი, ავტოტრანსპორტის მარკა, მოდელი, გამოშვების
//               წელი, სახელმწიფო ნომერი, საიდენტიფიკაციო ნომერი, ინფორმაცია
//               დასაზღვევი/დაზღვეული ობიექტის შესახებ, მართვის მოწმობის სერია,
//               ტიპი, ნომერი, გაცემის თარიღი, ვიდეო გამოსახულება, სადაზღვევო
//               შემთხვევის თარიღი და აღწერა, მიყენებული ზარალის ოდენობა. IP
//               მისამართი, რომლის გამოყენებაც ხორციელდება ვებ-გვერდებზე და სადაც
//               ხდება თქვენთვის შემოთავაზებული მომსახურების რეალიზაცია, Cookie -
//               ფაილები, აპლიკაციის ლოგები, IMEI კოდი, მონაცემები ვებ-გვერდზე
//               თქვენ მიერ განხორციელებული ქმედებების შესახებ, თქვენი
//               ადგილმდებარეობის შესახებ ინფორმაცია (მოწყობილობის ტიპი, ბრაუზერი,
//               რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა; თქვენ მიერ
//               მოთხოვნილი დომენის სახელი; თქვენი ინტერნეტ-სერვისის პროვაიდერის
//               (ISP) -კავშირის შესაბამისად, ხდება თქვენი ISP სახელის განსაზღვრა.
//               ვებ-გვერდზე თქვენი ვიზიტის თარიღი და დრო; ვებ-გვერდზე თქვენი
//               სესიის ხანგრძლიობა; ვებ-გვერდზე განხორციელებული ქმედებების შესახებ
//               ინფორმაცია, მათ შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ
//               ველი, მათი შევსების პროცესი და შესავსებად გამოყენებული დრო.
//               გვერდები, რომლებიც ვებ-გვერდზე გახსენით მისით სარგებლობისას;
//               თქვენი ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის
//               განმავლობაში; იმ ფაილის URL, რომელსაც ნახულობთ, და მასთან
//               დაკავშირებული ინფორმაცია; გვერდი, რომელმაც გადმოგამისამართათ ჩვენს
//               ვებ-გვერდზე; საოპერაციო სისტემა, რომელსაც იყენებს თქვენი
//               კომპიუტერი; ჩვენს ვებ-გვერდზე არსებულ „ტრაფიკზე“ თვალის მიდევნების
//               მიზნით ვიყენებთ სხვადასხვა ანალიტიკურ მომსახურებას). გარდა ამისა,
//               შესაბამისი სადაზღვევო მომსახურების გაწევის მიზნით კონკრეტულ
//               სადაზღვევო პროდუქტებთან მიმართებით, როგორიცაა სიცოცხლისა და
//               კრიტიკული დაავადებების დაზღვევა, სამოგზაურო დაზღვევა, ალდაგის მიერ
//               შესაძლოა ასევე თქვენგან გამოთხოვილ და დამუშავებულ იქნეს ისეთი
//               განსაკუთრებული კატეგორიის პერსონალური მონაცემები, რომლებიც
//               დაკავშირებულია თქვენს ჯანმრთელობასთან, ფიზიკურ მდგომარეობასთან,
//               მათ შორის: კონკრეტულ დაავადებებთან დაკავშირებით სიმპტომების
//               არსებობა, გადატანილი/არსებული დაავადებები, ნარკოტიკული/ალკოჰოლური
//               საშუალებების მოხმარება (სიხშირე). ასევე, ინფორმაცია ალდაგის მიერ
//               თქვენთვის გაწეული მომსახურებისა და თქვენ მიერ ალდაგისაგან მიღებული
//               პროდუქტების შესახებ, თქვენთან კომუნიკაციის შედეგად მოპოვებული
//               მონაცემები და ნებისმიერი სხვა ინფორმაცია, რომლის დამუშავების
//               ვალდებულება ალდაგს ეკისრება კანონმდებლობით. ჩვენ მიერ დამუშავებული
//               მონაცემების შეგროვება აუცილებელია საკანონმდებლო თუ ხელშეკრულებით
//               ნაკისრი ვალდებულებების უზრუნველსაყოფად და მოიცავს ასევე
//               განსახორციელებელ და განხორციელებულ გადახდებს, გადახდის ფორმას
//               (უნაღდო ანგარიშსწორების შემთხვევაში, საბანკო რეკვიზიტებს), თქვენს
//               მიერ არჩეულ სადაზღვევო პაკეტს, დაფარვის ტერიტორიას, ლიმიტებს და
//               სადაზღვევო პრემიის ოდენობას. მონაცემთა შეგროვებისას შეგატყობინებთ
//               თუ რა მონაცემებია სავალდებულოდ მოსაწოდებელი და რა შედეგები
//               შეიძლება დადგეს მათი მოუწოდებლობის შემთხვევაში. ჩვენ ინფორმაციას
//               ვაგროვებთ უშუალოდ თქვენგან, როდესაც საკუთარი ნებით გვაწვდით
//               მაგალითად, სადაზღვევო პროდუქტებით სარგებლობისთვის სადაზღვევო
//               განაცხადის შევსების გზით. ასევე, ვაგროვებთ სხვა წყაროებიდანაც.
//               მაგალითად, საჯარო წყაროებიდან, დაზღვევის ბროკერების, ჯანდაცვის
//               დაწესებულებების, ფინანსური ინსტიტუტების მიერ მოწოდებული
//               ინფორმაციის ფარგლებში.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               მონაცემთა დამუშავების მიზნები
//             </h2>
//             <p className="text-gray-600">
//               „ალდაგში“ თქვენი პერსონალური მონაცემები შესაძლოა დამუშავდეს
//               სხვადასხვა მიზნით, თუმცა მიზანი ყოველთვის არის კონკრეტული, მკაფიოდ
//               განსაზღვრული და კანონიერი. „კომპანიაში“ თქვენი მონაცემები
//               მუშავდება მხოლოდ იმ მოცულობით, რომელიც აუცილებელია კანონიერი
//               მიზნის მისაღწევად და მხოლოდ იმ ვადით, რაც აუცილებელია, მონაცემების
//               დამუშავების მიზნის მისაღწევად. თქვენი პერსონალური მონაცემები
//               შესაძლოა დამუშავდეს შემდეგი მიზნით (აღნიშნული ჩამონათვალი არ არის
//               ამომწურავი): კლიენტისათვის სადაზღვევო მომსახურების გაწევა და
//               სახელშეკრულებო ვალდებულებების შესრულება; სადაზღვევო მომსახურების
//               შეთავაზება, პირდაპირი მარკეტინგის განხორციელება, მომსახურების
//               გაუმჯობესება, თქვენ მიერ ვალდებულებების შესრულების მონიტორინგის
//               მიზნებისათვის; თქვენ მიერ ვებ-გვერდზე განხორციელებული ვიზიტის
//               შესახებ ინფორმაციის შეგროვება, მათ შორის ვებ-გვერდზე თქვენი ქცევის
//               შესასწავლად, თქვენ მიერ გაკეთებული არჩევანის დასამახსოვრებლად,
//               მოძიებული ინფორმაციის ანალიზისათვისა და შემდგომში თქვენზე
//               მორგებული/პერსონალური შეთავაზებების განსახორციელებლად; ვებ-გვერდზე
//               არსებული სხვადსხვა საკომუნიკაციო საშუალებით ჩვენთვის დატოვებულ
//               შეტყობინებებზე რეაგირების მიზნით; თქვენთვის საჭიროებისამებრ
//               შეტყობინებების/კორეპონდენციების გადმოსაგზავნად; თქვენზე „ალდაგში“
//               დაცული პერსონალური მონაცემების განახლება, შეცვლა; „კომპანიის“
//               შესახებ სიახლეების გაცნობა, სხვადასხვა „ბენეფიტის“ (დამატებითი
//               სარგებლის) შეთავაზება; სადაზღვევო შემთხვევის დადგენა, მისი
//               მოცულობის განსაზღვრა; სადაზღვევო შემთხვევის შედეგად დამდგარი
//               ზარალის რეგულირება; სადაზღვევო ანაზღაურების გაცემა; მზღვეველის
//               სუბროგაციის უფლების გამოყენება; ადაზღვევო საქმიანობის აგენტის და
//               ბროკერის მეშვეობით განხორციელება; თანამშრომელთა და მათი ოჯახის
//               წევრების ჯანმრთელობის დაზღვევით უზრუნველყოფა; მონაცემთა
//               დამუშავებაზე პასუხისმგებელი პირის, როგორც არასახელმწიფო საპენსიო
//               სქემის დამფუძნებლის მიერ კანონმდებლობით ნაკისრი ვალდებულებების
//               შესრულება; კანონმდებლობით დაკისრებული ვალდებულების შესრულება -
//               კლიენტის, მესამე პირის, მინდობილი პირის იდენტიფიკაცია; ფულის
//               გათეთრების, თაღლითობის და სხვა დანაშაულის პრევენცია და კონტროლი;
//               ჩვენ მიერ განსაზღვრული სხვადსხვა მიზნებისათვის კვლევების
//               განხორციელება, რეპორტების/ანგარიშების შედგენა; მომხმარებლებისთვის
//               ავტო აუქციონის მომსახურების გაწევა; კომპანიის მიერ სამეწარმეო
//               საქმიანობის განხორციელების დროს სხვადასხვა ხელშეკრულების
//               გაფორმება; სახელშეკრულებო ურთიერთობების ფარგლებში ნაკისრი
//               უფლება-მოვალეობების შესრულება; საჩივრების/პრეტენზიების განხილვა და
//               მათზე რეაგირება; ჩვენი ზედამხედველი ორგანოსათვის და აუდიტორული
//               კომპანიებისათვის მონაცემთა ხელმისაწვდომობის უზრუნველსაყოფად;
//               კანონმდებლობით გათვალისწინებული ვალდებულებების შესრულება;
//               პირდაპირი მარკეტინგის განხორციელება.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               მონაცემთა დამუშავების საფუძველი
//             </h2>
//             <p className="text-gray-600">
//               „კომპანიაში“ თქვენი პერსონალური მონაცემები მუშავდება მხოლოდ
//               შესაბამისი საფუძვლის არსებობის შემთხვევაში. მონაცემთა დამუშავების
//               დროს შესაძლოა არსებობდეს ერთი ან ერთდროულად რამდენიმე საფუძველი.
//               ჩვენ მიერ პერსონალური მონაცემების დამუშავება ხორციელდება შემდეგი
//               საფუძვლების არსებობისას: არსებობს მონაცემთა სუბიექტის, თქვენი
//               ნებაყოფლობითი თანხმობა მონაცემთა ერთი ან რამდენიმე კონკრეტული
//               მიზნით დამუშავებაზე, რომელიც შესაძლოა გამოხატული იყოს, როგორც
//               წერილობითი, ისე ზეპირი, სატელეკომუნიკაციო, ელექტრონული ან სხვა
//               შესაბამისი ფორმით; მონაცემთა დამუშავება აუცილებელია მონაცემთა
//               სუბიექტთან დადებული გარიგებით ნაკისრი ვალდებულების შესასრულებლად
//               ან მონაცემთა სუბიექტის მოთხოვნით გარიგების დასადებად; მონაცემთა
//               დამუშავება გათვალისწინებულია კანონით; მონაცემთა დამუშავება საჭიროა
//               „ალდაგის“ მიერ მისთვის კანონმდებლობით დაკისრებული მოვალეობების
//               შესასრულებლად; მონაცემები კანონმდებლობის თანახმად საჯაროდ
//               ხელმისაწვდომია ან მონაცემთა სუბიექტმა იგი საჯაროდ ხელმისაწვდომი
//               გახადა; მონაცემთა დამუშავება საჭიროა მონაცემთა სუბიექტის ან სხვა
//               პირის სასიცოცხლო ინტერესების დასაცავად; მონაცემთა დამუშავება
//               აუცილებელია მნიშვნელოვანი საჯარო ინტერესის დასაცავად; მონაცემთა
//               დამუშავება აუცილებელია საქართველოს კანონმდებლობით განსაზღვრული
//               საჯარო ინტერესის სფეროსათვის მიკუთვნებული ამოცანების
//               შესასრულებლად; მონაცემთა დამუშავება აუცილებელია „ალდაგის“ ან
//               მესამე პირის მნიშვნელოვანი ლეგიტიმური ინტერესების დასაცავად, გარდა
//               იმ შემთხვევისა, თუ არსებობს მონაცემთა სუბიექტის (მათ შორის,
//               არასრულწლოვანის) უფლებების დაცვის აღმატებული ინტერესი; მონაცემთა
//               დამუშავება აუცილებელია კანონის შესაბამისად მნიშვნელოვანი საჯარო
//               ინტერესის დასაცავად; მონაცემთა დამუშავება აუცილებელია მონაცემთა
//               სუბიექტის განცხადების განსახილველად და მისთვის მომსახურების
//               გასაწევად. თქვენი განსაკუთრებული კატეგორიის მონაცემთა დამუშავება
//               ხდება მხოლოდ იმ პირობებში, რომ უზრუნველყოფილია თქვენი უფლებებისა
//               და ინტერესების დაცვის საქართველოს კანონმდებლობით გათვალისწინებული
//               გარანტიები და არსებობს მონაცემთა სუბიექტის წერილობითი თანხმობა
//               ერთი ან რამდენიმე კონკრეტული მიზნით განსაკუთრებული კატეგორიის
//               მონაცემთა დამუშავებაზე. გარდა აღნიშნულისა, თქვენი განსაკუთრებული
//               მონაცემები ჩვენ მიერ შესაძლებელია დამუშავდეს იმ შემთხვევაში, თუ
//               მათი დამუშავება პირდაპირ და სპეციალურად რეგულირდება კანონით და
//               მათი დამუშავება არის აუცილებელი და პროპორციული ზომა დემოკრატიულ
//               საზოგადოებაში, ასევე თუკი მათი დამუშავება აუცილებელია თქვენი ან
//               სხვა პირის სასიცოცხლო ინტერესების დასაცავად და კანონმდებლობით
//               გათვალისწინებულ სხვა შემთხვევებში.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               ავტომატიზებული გადაწყვეტილებები
//             </h2>
//             <p className="text-gray-600">
//               სადაზღვევო რისკების შეფასებისას ან თაღლითობის პრევენციის მიზნით
//               გასატარებელი ღონისძიებები შესაძლოა მოიცავდეს პროფილირებასაც, რაც
//               გულისხმობს რომ შესაძლოა დავამუშაოთ თქვენს შესახებ ინფორმაცია
//               პროგრამული უზრუნველყოფის მეშვეობით, რომელიც შეაფასებს თქვენს
//               პერსონალურ ასპექტებს და წინასწარ განსაზღვრავს მოსალოდნელ რისკებსა
//               და შესაძლო შედეგებს. ასევე შესაძლოა გამოვიყენოთ პროფილირება ან
//               სხვაგვარად ჩავრთოთ ავტომატიზებული საშუალებები თქვენს შესახებ
//               გადაწყვეტილების მისაღებად, რომლის საფუძველზეც გაწვდით დაზღვევის
//               მომსახურებას. ამ შემთხვევაში სახეზეა „ავტომატიზებული ინდივიდუალური
//               გადაწყვეტილების მიღება, რომელიც დასაშვებია მხოლოდ ამ ტიპის
//               გადაწყვეტილების მისაღებად შესაბამისი საფუძვლის არსებობის
//               შემთხვევაში. ჩვენ შეიძლება ამგვარი გადაწყვეტილებები მივიღოთ
//               თქვენზე, როდესაც: გადაწყვეტილებები საჭიროა ხელშეკრულების
//               დასადებად. მაგალითად, ჩვენ შეიძლება მივიღოთ გადაწყვეტილება
//               თქვენთვის მორგებული დაზღვევის ტიპების შესახებ, სადაზღვევო პრემიის
//               გამოსათვლელად თქვენი სადაზღვევო ისტორიიდან გამომდინარე ან სხვა
//               ფინანსური ინფორმაციიდან გამომდინარე, ან საერთოდაც უარი გეთქვათ
//               მომსახურებაზე. ამგვარი გადაწყვეტილებები გათვალისწინებულია კანონით
//               ან კანონის საფუძველზე დელეგირებული უფლებამოსილების ფარგლებში
//               გამოცემული კანონქვემდებარე ნორმატიული აქტით, მაგალითად, თაღლითობის
//               პრევენციის მიზნებისთვის. გვაძლევთ თანხმობას ავტომატიზებული
//               ინდივიდუალური გადაწყვეტილების მისაღებად. შეგიძლიათ დაგვიკავშირდეთ
//               ავტომატიზებული ინდივიდუალური გადაწყვეტილების შესახებ დამატებითი
//               ინფორმაციის მისაღებად. ასევე, უფლება გაქვთ უარი განაცხადოთ ან
//               მოითხოვოთ ადამიანური რესურსის ჩართვა ავტომატიზებული ინდივიდუალური
//               გადაწყვეტილების მიღების პროცესში.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               თქვენი მონაცემების მიმღები პირები
//             </h2>
//             <p className="text-gray-600">
//               ჩვენ ვიღებთ ვალდებულებას დავიცვათ მიღებული ნებისმიერი სახის
//               ინფორმაციის კონფიდენციალურობა და უსაფრთხოება. თუმცა, პერსონალური
//               მონაცემების გადაცემა/გამჟღავნება მესამე პირებისთვის, შესაძლოა
//               საჭირო გახდეს კანონმდებლობით პირდაპირ გათვალისწინებულ შეთხვევებში
//               ან მომხმარებელთან გაფორმებული დაზღვევის ხელშეკრულებით
//               გათვალისწინებულ ფარგლებში. აქედან გამომდინარე, ზოგიერთი კატეგორიის
//               პერსონალური მონაცემების მიმღები შესაძლოა იყოს: სამართალდამცავი
//               ორგანოები ან სხვა პირი, ზარალის თავიდან აცილებისა ან/და მისი
//               დარეგულირებისა და ანაზღაურების მიზნით, ასევე კანონმდებლობით
//               განსაზღვრული საჯარო ინტერესის სფეროში შემავალი ამოცანების (მათ
//               შორის, დანაშაულის აცილების, დანაშაულის გამოძიების,
//               სისხლისსამართლებრივი დევნის, მართლმსაჯულების განხორციელების და
//               ა.შ.) შესასრულებლად; ნებისმიერი ადგილობრივი სახელმწიფო
//               ორგანიზაციები/სამსახურები, კანონმდებლობით განსაზღვრული მოთხოვნების
//               შესრულების მიზნით; სხვა პირი (ფიზიკური ან იურიდიული), რომელიც
//               თქვენს პერსონალურ მონაცემებს ამუშავებს „ალდაგისთვის“ ან მისი
//               სახელით, მხოლოდ იმ შემთხვევაში, თუ „ალდაგს“ გაფორმებული აქვს
//               დამუშავებაზე უფლებამოსილ პირთან შესაბამისი წერილობითი
//               ხელშეკრულება. ხელშეკრულების გაფორმებამდე „ალდაგი“ ყოველთვის
//               წინასწარ რწმუნდება მხარის სანდოობაში და ხელშეკრულებით
//               ითვალისწინებს დამუშავებაზე უფლებამოსილი პირის ვალდებულებას,
//               უზრუნველყოს ისეთი ორგანიზაციული და ტექნიკური ზომები, რაც დაიცავს
//               თქვენს მონაცემებს, ხოლო ხელშეკრულების გაფორმების შემდეგ
//               მონიტორინგს უწევს დამუშავებაზე უფლებამოსილი პირის მიერ მისი
//               ვალდებულებების შესრულების პროცესს - მისი წარმომადგენლების
//               მეშვეობით ამოწმებს დამუშავებაზე უფლებამოსილი პირის სამუშაო ადგილს,
//               სადაც ხორციელდება თქვენი პერსონალური მონაცემების დამუშავება და
//               ადგილზე ახორციელებს ინსპექტირებას მონაცემთა უსაფრთხოებისთვის
//               გატარებული ღონისძიებების შემოწმების მიზნით. აღნიშნული
//               ვალდებულებების დარღვევისთვის „ალდაგსა“ და დამუშავებაზე უფლებამოსილ
//               პირს შორის გაფორმებული ხელშეკრულებები ითვალისწინებს სანქციებს.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">მონაცემთა შენახვის ვადა</h2>
//             <p className="text-gray-600">
//               მონაცემები შეინახება თქვენი მომსახურების მთელი პერიოდის
//               განმავლობაში, იმ ვადით, რაც საჭიროა ზემოთ ჩამოთვლილი მიზნების
//               მისაღწევად, მათ შორის, თქვენთან სადაზღვევო მომსახურების შეწყვეტის
//               შემდგომაც, თუ ეს საჭიროა კანონმდებლობით გათვალისწინებული
//               ვალდებულებების შესასრულებლად.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               კონფიდენციალობის გარანტიები
//             </h2>
//             <p className="text-gray-600">
//               ალდაგი უზრუნველვყოფს მოწოდებული ინფორმაციის მაქსიმალურ დაცულობას
//               კანონმდებლობით დადგენილი წესით. ჩვენ ვზრუნავთ თქვენი ინფორმაციის
//               უსაფრთხოებასა და კონფიდენციალურობაზე, თუმცა, ვიხსნით
//               პასუხისმგებლობას მესამე პირების მიერ ინფორმაციის არასანქცირებულ
//               წვდომაზე ამ მონაცემების კომპანიისთვის მოწოდების დროს (მათ შორის,
//               ინფორმაციის დისტანციურად მოწოდებისას). თქვენ პასუხისმგებლობას
//               იღებთ მოწოდებული ინფორმაციის სიზუსტეზე. თქვენი მონაცემების
//               ცვლილებების შემთხვევაში, შეგიძლიათ გვაცნობოთ აღნიშნულის თაობაზე და
//               შეძლებისდაგვარად მყისიერად, თუმცა, არაუგვიანეს 10 დღისა მოვახდენთ
//               რეაგირებას და ავსახავთ ცვლილებებს შესაბამის მონაცემთა ბაზებში.
//               ალდაგი იღებს სათანადო უსაფრთხოების ზომებს, რათა დაიცვას მისი
//               კონტროლის ქვეშ არსებული მონაცემები არაუფლებამოსილი წვდომისგან,
//               მათი უკანონო გამოყენებისგან და გამჟღავნებისგან, განადგურებისგან ან
//               შემთხვევითი დაკარგვისგან. კომპანია უზრუნველვყოფს ასევე
//               უსაფრთხოების სათანადო ზომებისა და პროცედურების არსებობას, მას
//               გააჩნია დოკუმენტირებული ინფორმაციული უსაფრთხოების პროგრამა და
//               ინფორმაციული უსაფრთხოების პოლიტიკა, სადაც განსაზღვრულია
//               მმართველობითი, ტექნიკური, საოპერაციო და ფიზიკური უსაფრთხოების
//               კონტროლის ღონისძიებები, რომლებიც შეგროვებული ინფორმაციისა და ჩვენი
//               ბიზნესის თავისებურებების თანაბარზომიერია. ჩვენ გულისხმიერად
//               ვეკიდებით თქვენი კონფიდენციალურობისა და მონაცემთა დაცვის უფლებებს
//               და წინამდებარე პოლიტიკით განსაზღვრული შემთხვევების გარდა, თქვენ
//               მონაცემებს გავამჟღავნებთ მხოლოდ იმ შემთხვევაში თუ ამას მოითხოვს
//               კანონი, საზედამხედველო, მარეგულირებელი ან/და სამართალდამცავი
//               ორგანოები, ან/და საკუთარი უფლებების ან სხვათა უფლებების დასაცავად
//               და კანონმდებლობით გათვალისწინებულ სხვა შემთხვევებში.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               თქვენი მონაცემთა დაცვის უფლებები
//             </h2>
//             <p className="text-gray-600">
//               თქვენ, გაქვთ შესაძლებლობა ისარგებლოთ კანონმდებლობით მონიჭებული
//               ყველაუფლებამოსილებით. მათ შორის: მონაცემთა დამუშავების შესახებ
//               ინფორმაციის მიღების უფლება თქვენ გაქვთ უფლება, ჩვენ და
//               დამუშავებაზე უფლებამოსილ პირს მოსთხოვოთ იმის დადასტურება,
//               მუშავდება თუ არა თქვენ შესახებ მონაცემები, დასაბუთებულია თუ არა
//               მონაცემთა დამუშავება და მოთხოვნის შესაბამისად უსასყიდლოდ მიიღოთ
//               შემდეგი ინფორმაცია: ა) თქვენ შესახებ იმ მონაცემის თაობაზე, რომელიც
//               მუშავდება, აგრეთვე ამ მონაცემის დამუშავების საფუძვლისა და მიზნის
//               შესახებ; ბ) მონაცემთა შეგროვების/მოპოვების წყაროს შესახებ; გ)
//               მონაცემთა შენახვის ვადის (დროის) შესახებ, ხოლო თუ კონკრეტული ვადის
//               განსაზღვრა შეუძლებელია, ვადის განსაზღვრის კრიტერიუმების თაობაზე;
//               დ) მონაცემთა სუბიექტის ამ თავით გათვალისწინებული უფლებების
//               შესახებ; ე)მონაცემთა გადაცემის სამართლებრივი საფუძვლისა და
//               მიზნების, აგრეთვე მონაცემთა დაცვის სათანადო გარანტიების შესახებ,
//               თუ მონაცემები გადაეცემა სხვა სახელმწიფოს ან საერთაშორისო
//               ორგანიზაციას; ვ) მონაცემთა მიმღების ვინაობის ან მონაცემთა
//               მიმღებების კატეგორიების შესახებ, მათ შორის, ინფორმაცია მონაცემთა
//               გადაცემის საფუძვლისა და მიზნის თაობაზე, თუ მონაცემები მესამე პირს
//               გადაეცემა; ზ) ავტომატიზებული დამუშავების, მათ შორის, პროფაილინგის
//               შედეგად მიღებული გადაწყვეტილების და იმ ლოგიკის შესახებ, რომელიც
//               გამოიყენება ამგვარი გადაწყვეტილების მისაღებად, აგრეთვე მონაცემთა
//               დამუშავებაზე მისი გავლენისა და დამუშავების მოსალოდნელი/სავარაუდო
//               შედეგის თაობაზე. მონაცემთა გაცნობისა და ასლის მიღების უფლება
//               თქვენ, როგორც მონაცემთა სუბიექტს უფლება გაქვთ, ჩვენთან და
//               დამუშავებაზე უფლებამოსილ პირთან გაეცნოთ თქვენ შესახებ არსებულ
//               პერსონალურ მონაცემებს და უსასყიდლოდ მიიღოთ ამ მონაცემების ასლები,
//               გარდა კანონმდებლობით გათვალისწინებული გამონაკლისებისა. მონაცემთა
//               გასწორების, განახლებისა და შევსების უფლება თქვენ უფლება გაქვთ,
//               ჩვენ და დამუშავებაზე უფლებამოსილ პირს მოგვთხოვოთ თქვენ შესახებ
//               მცდარი, არაზუსტი ან/და არასრული მონაცემების გასწორება, განახლება
//               ან/და შევსება. მონაცემთა დამუშავების შეწყვეტის, წაშლის ან
//               განადგურების უფლება თქვენ უფლება გაქვთ, ჩვენ და დამუშავებაზე
//               უფლებამოსილ პირს მოსთხოვოთ თქვენ შესახებ მონაცემთა დამუშავების
//               (მათ შორის, პროფაილინგის) შეწყვეტა, წაშლა ან განადგურება.
//               მონაცემთა დაბლოკვის უფლება თქვენ, როგორც მონაცემთა სუბიექტს უფლება
//               გაქვთ, ჩვენ და დამუშავებაზე უფლებამოსილ პირს მოსთხოვოთ მონაცემთა
//               დაბლოკვა, თუ არსებობს ერთ-ერთი შემდეგი გარემოება: ა) სადავოდ ხდით
//               მონაცემების ნამდვილობას ან სიზუსტეს; ბ) მონაცემთა დამუშავება
//               უკანონოა, თუმცა ეწინააღმდეგებით მათ წაშლას და ითხოვს მონაცემთა
//               დაბლოკვას; გ) მონაცემები საჭირო აღარ არის მათი დამუშავების მიზნის
//               მისაღწევად, თუმცა თქვენ ისინი გჭირდებათ საჩივრის/სარჩელის
//               წარსადგენად; დ) თქვენ მოითხოვეთ მონაცემთა დამუშავების შეწყვეტა,
//               წაშლა ან განადგურება და მიმდინარეობს ამ მოთხოვნის განხილვა; ე)
//               არსებობს მონაცემების მტკიცებულებად გამოყენების მიზნით შენახვის
//               აუცილებლობა. მონაცემთა გადატანის უფლება კანონმდებლობით
//               გათვალისწინებული საფუძვლებით მონაცემთა ავტომატური დამუშავების
//               შემთხვევაში, თუ ეს ჩვენი მხრიდან ტექნიკურად შესაძლებელია, უფლება
//               გაქვთ, ჩვენგან და დამუშავებაზე უფლებამოსილი პირისგან
//               სტრუქტურიზებული, საზოგადოდ გამოყენებადი და მანქანურად წაკითხვადი
//               ფორმატით მიიღოთ თქვენ მიერ მოწოდებული მონაცემები ან მოითხოვოთ ამ
//               მონაცემთა სხვა დამუშავებისთვის პასუხისმგებელი პირისთვის გადაცემა.
//               ავტომატიზებული ინდივიდუალური გადაწყვეტილების მიღება და მასთან
//               დაკავშირებული უფლებები თქვენ უფლება გაქვთ, არ დაექვემდებაროთ
//               მხოლოდ ავტომატიზებულად, მათ შორის, პროფაილინგის საფუძველზე,
//               მიღებულ გადაწყვეტილებას, რომელიც თქვენთვის წარმოშობს სამართლებრივ
//               ან სხვა სახის არსებითი მნიშვნელობის მქონე შედეგს, გარდა
//               კანონმდებლობით გათვალისწინებული შემთხვევებისა. თანხმობის
//               გამოხმობის უფლება თქვენ უფლება გაქვთ, ნებისმიერ დროს, ყოველგვარი
//               განმარტების ან დასაბუთების გარეშე გამოიხმოთ თქვენ მიერ გაცემული
//               თანხმობა პერსონალური მონაცემების დამუშავების თაობაზე. ამ
//               შემთხვევაში, თქვენი მოთხოვნის შესაბამისად, ჩვენ შევწყვეტთ
//               მონაცემთა დამუშავებას ან/და წავშლით ან გავანადგურებთ დამუშავებულ
//               მონაცემებს კანონმდებლობით დადგენილ ვადებში, თუ მონაცემთა
//               დამუშავების სხვა საფუძველი არ იარსებებს. თქვენ უფლება გაქვთ,
//               თანხმობა გამოიხმოთ იმავე ფორმით, რომლითაც თანხმობა განაცხადეთ.
//               ამასთან, აღნიშნულის განხორციელება ასევე შეგიძლიათ ჩვენს იურიდიულ
//               მისამართზე წერილობითი შეტყობინების გამოგზავნის, ჩვენს ტელეფონის
//               ნომერზე (+995 322 444 999) დაკავშირებით, ჩვენს ელექტრონულ
//               მისამართზე: personaldata@aldagi.ge ელექტრონული შეტყობინების
//               გამოგზავნის ან ჩვენს ნებისმიერ ოფისში მოთხოვნის გაცხადების გზით.
//               თქვენ უფლება გაქვთ თანხმობის გამოხმობამდე მოგვთხოვოთ და მიიღოთ
//               ინფორმაცია თანხმობის გამოხმობის შესაძლო შედეგების შესახებ. გთხოვთ
//               გაითვალისწინოთ, რომ ზემოაღნიშნული უფლებების რეალიზებისთვის ჩვენ
//               მოვახედენთ თქვენს იდენტიფიკაციას, რათა დავრწმუნდეთ, რომ
//               პერსონალური მონაცემების შემცველი ინფორმაცია მიეწოდება მონაცემთა
//               სუბიექტს ან ამისთვის სათანადოდ უფლებამოსილ პირს. გასაჩივრების
//               უფლება თქვენ უფლება გაქვთ, „პერსონალურ მონაცემთა დაცვის შესახებ“
//               საქართველოს კანონმდებლობით დადგენილი უფლებებისა და წესების
//               დარღვევის შემთხვევაში კანონით დადგენილი წესით მიმართოთ პერსონალურ
//               მონაცემთა დაცვის სამსახურს, სასამართლოს ან/და ზემდგომ
//               ადმინისტრაციულ ორგანოს. ამასთან, ჩვენი ქმედების გასაჩივრების
//               უფლებამოსილება გაქვთ ჩვენს ოფიციალურ ელექტრონულ მისამართზე:
//               personaldata@aldagi.ge -ზე. პირდაპირი მარკეტინგის მიზნით
//               გაცხადებული თანხმობის გამოხმობის უფლება თქვენ ასევე გაქვთ უფლება
//               გამოიხმოთ პირდაპირი მარკეტინგის მიზნით გაცხადებული თანხმობა
//               ნებისმიერ დროს, ყოველგვარი საფასურის გადახდის გარეშე იმავე ფორმით,
//               რომლითაც პირდაპირი მარკეტინგი ხორციელდება თქვენ მიმართ. ასევე,
//               საჭიროების შემთხვევაში, თანხმობის გამოხმობის უფლება გაქვთ ჩვენს
//               ტელეფონის ნომერზე (+995 322 444 999) დარეკვის, ჩვენს ელექტრონულ
//               მისამართზე: personaldata@aldagi.ge ელექტრონული შეტყობინების
//               გამოგზავნის ან ჩვენს ნებისმიერ ოფისში მოთხოვნის გაცხადების გზით.
//               ზემოაღნიშნული უფლებები არააბსოლუტურია და შესაძლოა შეიზღუდოს
//               კანონმდებლობით გათვალისწინებულ შემთხვევებში. ცვლილებები მონაცემთა
//               დაცვის პოლიტიკაში უფლებას ვიტოვებთ ნებისმიერ დროს განვაახლოთ
//               პოლიტიკა. თქვენი პერსონალური მონაცემების დამუშავებაში ან პოლიტიკის
//               არსებითი ცვლილებების შემთხვევაში, გექნებათ საშუალება გაეცნოთ
//               შეცვლილ პირობებს. ეს პოლიტიკა ვრცელდება ყველა ინფორმაციაზე,
//               რომელსაც ვებგვერდის მეშვეობით ვამუშავებთ თქვენს შესახებ.
//             </p>
//           </section>

//           <section ref={marketingTermsRef} className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               პირდაპირი მარკეტინგის დათქმა
//             </h2>
//             <p className="text-blue-600">
//               ინფორმირებული თანხმობა პირდაპირი მარკეტინგის მიზნით მონაცემთა
//               დამუშავების შესახებ
//             </p>

//             <p className="text-gray-600">
//               თქვენ, როგორც მომხმარებელი, პირდაპირი მარკეტინგის მიზნით მონაცემთა
//               დამუშავებაზე თანხმობის გამოხატვის შემთხვევაში, ადასტურებთ, რომ:
//               გაეცანით სს „სადაზღვევო კომპანია ალდაგის“ (ს.ნ 404476189)
//               (შემდგომში - „მზღვეველი“) კონფიდენციალურობის პოლიტიკას
//               https://aldagi.ge/privacy-policy და ეთანხმებით, რომ მზღვეველმა
//               პირდაპირი მარკეტინგის მიზნით (საქონლის, იდეის, მომსახურების,
//               სამუშაოს ან/და წამოწყების, შეთავაზება ან აღნიშნულის თაობაზე
//               ინფორმირება) დაამუშაოს (სარეკლამო ხასიათის შეტყობინებების გაგზავნა
//               ტელეფონის, ფოსტის, ელექტრონული ფოსტის ან სხვა ელექტრონული
//               საშუალებით) თქვენი პერსონალური მონაცემები (სახელი, გვარი,
//               მისამართი, ტელეფონის ნომერი და ელექტრონული ფოსტის მისამართი),
//               ასევე ამავე მიზნით გადასცეს აღნიშნული მონაცემები დაკავშირებულ
//               (აფილირებულ) შემდეგ კომპანიებს: სს „სადაზღვევო კომპანია ტაო“ (ს.ნ
//               202408386), სს „სადაზღვევო კომპანია იმედი ელ“ (ს.ნ 204919008), სს
//               „გრინვეი საქართველო“ (ს.ნ 404867006), შპს „ამბოლი“ (ს.ნ
//               216402701), სს „არდი დაზღვევა“ (ს.ნ 405662242) და ისინი, რომელთა
//               წილების/აქციების 50%-ის ან მეტის პირდაპირ ან არაპირდაპირ მფლობელს
//               წარმოადგენს სს „საქართველოს კაპიტალი" (ს.ნ 404549690)); თქვენთვის
//               ცნობილია, რომ პირდაპირი მარკეტინგის მიზნით მონაცემების
//               დამუშავებაზე თანხმობა არ არის სავალდებულო და თანხმობის გაუცემლობა
//               ან შემდგომ გამოხმობა არ გამოიწვევს თქვენთვის ძირითადი მომსახურების
//               შეწყვეტას/მომსახურებაზე უარის თქმას. ამასთან, გაქვთ უფლება,
//               ნებისმიერ დროს მოითხოვოთ პირდაპირი მარკეტინგის მიზნით მონაცემთა
//               დამუშავების შეწყვეტა, ხოლო მზღვეველი უზრუნველყოფს ამ მოთხოვნის
//               რეალიზებას სრულიად უფასოდ, იმავე ფორმით, რომლითაც პირდაპირი
//               მარკეტინგი განხორციელდება. თანხმობის გამოხმობა, მათ შორის,
//               შეგიძლიათ ტელეფონის ნომერზე (+995 322 444 999), ელ. ფოსტის
//               მისამართზე (personaldata@aldagi.ge) ან მზღვეველის ნებისმიერ ოფისში
//               მოთხოვნის გაცხადების გზით, როგორც უშუალოდ მზღვეველის, ისე
//               აფილირებული პირების მიერ მონაცემთა დამუშავების შეწყვეტის მიზნით.
//             </p>
//           </section>

//           <section className="space-y-3">
//             <h2 className="text-xl font-semibold">
//               "მზა ჩანაწერების" განაცხადი
//             </h2>
//             <p className="text-gray-600">
//               რა არის ე.წ. „მზა ჩანაწერები“ („Cookies“) „მზა ჩანაწერები“ არის
//               მცირე მოცულობის ინფორმაციის შემცველი ტექსტური ფაილები, რომელსაც
//               თქვენი კომპიუტერი, ტელეფონი, ან პლანშეტი ბრაუზერის მეშვეობით
//               ინახავს ჩვენს ვებგვერდზე ან ჩვენს სხვა დისტანციურ პლატფორმებზე
//               ვიზიტისას. „მზა ჩანაწერების“ სახეები და მათი დამუშავების მიზანი
//               ჩვენ მიერ გამოიყენება როგორც „სავალდებულო/აუცილებელი“, ასევე
//               „არასავალდებულო“ „მზა ჩანაწერები“. „მზა ჩანაწერების“ გამოყენებას
//               მრავალი სხვადასხვა დანიშნულება აქვს, საერთო ჯამში კი, მათი
//               გამოყენება ემსახურება ჩვენი სერვისით სარგებლობისას თქვენი
//               გამოცდილების გამარტივებასა და გაუმჯობესებას, სერვისით სარგებლობის
//               შესახებ ანალიტიკური/მარკეტინგული ინფორმაციის მოპოვებას და ასევე,
//               უსაფრთხოების დაცვის მიზანს. „სავალდებულო“ „მზა ჩანაწერების“
//               გამოყენება აუცილებელია ვებგვერდის/პლატფორმის ფუნქციონირებისა და
//               მასში ოპერირებისთვის. „სავალდებულო“ „მზა ჩანაწერები“ მუშავდება
//               ჩვენს ვებგვერდზე/პლატფორმაზე ყოველი ვიზიტის ფარგლებში, ვინაიდან,
//               აღნიშნულის გარეშე ჩვენი ონლაინ სერვისებით სარგებლობა ტექნიკურად
//               შესაძლებელი არ იქნება. რაც შეეხება „არასავალდებულო“ „მზა
//               ჩანაწერებს“, ჩვენ მიერ გამოყენებული „არასავალდებულო“ მზა
//               ჩანაწერები და მათი გამოყენების მიზნები შემდეგია: ა) ანალიტიკური -
//               უზრუნველყოფს მომხმარებლის ქცევის შესწავლას ანალიტიკური ჩანაწერების
//               შეგროვებისა და დამუშავების გზით. მათი მეშვეობით ვსწავლობთ,
//               ვებ-გვერდის რომელ ნაწილთან აქვს უფრო ხშირი შეხება მომხმარებელს და
//               რითია მეტად დაინტერესებული. ბ) ფუნქციური - მათი მეშვეობით
//               ვიმახსოვრებთ ვებ-გვერდის მოხმარებისას მომხმარებლების მიერ
//               გაკეთებულ არჩევანს რათა სამომავლოდ მათი გამოცდილება გაუმჯობესებულ
//               და გამარტივებულ იქნას. გ) პირად ელექტრონულ ფოსტასთან დაკავშირებული
//               „მზა ჩანაწერები“ - ვებ-გვერდი მომხმარებელს აძლევს შესაძლებლობას
//               დაარეგისტრიროს საკუთარი ელექტრონული ფოსტის მისამართი და ამ გზით
//               გამოიწეროს ჩვენი სიახლეები. ამ „მზა ჩანაწერებმა“ შესაძლოა
//               მომხმარებელს შეახსენოს თავისი ელექტრონული ფოსტის დარეგისტრირების
//               შესაძლებლობის შესახებ. დ) მესამე მხარის „მზა ჩანაწერები“ -
//               აღნიშნული წარმოადგენს იმგვარ ფაილებს, რომლებიც გამოიყენება
//               მარკეტინგული და ანალიტიკური მიზნებისათვის და მათი შეგროვება ხდება
//               სხვადასხვა სანდო გვერდიდან. ე) „მზა ჩანაწერები“ ვებ-გვერდის
//               პარამეტრების შესახებ - აღნიშნული ფაილები გამოიყენება იმ
//               შემთხვევაში, როდესაც მომხმარებელი სარგებლობს ვებ-გვერდით და მას
//               ვებ-გვერდის მომსახურება შეფერხებებით მიეწოდება მისი პარამეტრების
//               „ბრალეულობით.“ რა ინფორმაციას ვამუშავებთ თქვენ შესახებ „მზა
//               ჩანაწერების“ მეშვეობით და რა ვადით ვებგვერდზე ვიზიტისას გროვდება
//               შემდეგი ინფორმაცია: ა) თქვენი IP მისამართი; ბ) თქვენი მოწყობილობის
//               ტიპი და ბრაუზერი, რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა;
//               გ) თქვენ მიერ მოთხოვნილი დომენის სახელი; დ) თქვენი
//               ინტერნეტ-სერვისის პროვაიდერის სახელი; ე) ვებ-გვერდზე თქვენი
//               ვიზიტის თარიღი და დრო; ვ) ვებ-გვერდზე თქვენი სესიის ხანგრძლივობა;
//               ზ) ვებ-გვერდზე განხორციელებული ქმედებების შესახებ ინფორმაცია, მათ
//               შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ ველი, მათი
//               შევსების პროცესი და შესავსებად გამოყენებული დრო; თ) გვერდები,
//               რომლებიც ვებ-გვერდზე გახსენით მისით სარგებლობისას; ი) თქვენი
//               ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის
//               განმავლობაში; კ) თქვენ მიერ გახსნილი ფაილის URL (Uniform Resource
//               Locator - ერთიანი რესურსების ლოკატორი) და მასთან დაკავშირებული
//               ინფორმაცია; ლ) გვერდი, რომელმაც გადმოგამისამართათ ჩვენს
//               ვებ-გვერდზე; მ) საოპერაციო სისტემა, რომელსაც იყენებს თქვენი
//               მოწყობილობა; ნ) ჩვენს ვებ-გვერდზე არსებულ „ტრაფიკზე“ თვალის
//               მიდევნების მიზნით სხვადასხვა ანალიტიკური მომსახურების ფარგლებში
//               მოგროვებული ინფორმაცია. ზემოაღნიშნულ მონაცემებს ვინახავთ არაუმეტეს
//               1 (ერთი) წლის ვადით. მონაცემთა სუბიექტის უფლებები და „მზა
//               ჩანაწერების“ გამოყენების მართვა ვებგვერდზე შესვლისას მონაცემთა
//               სუბიექტს ეძლევა შესაძლებლობა გაეცნოს „მზა ჩანაწერების“ პოლიტიკას
//               და დაეთანხმოს მათ გამოყენებას „თანხმობის“ ღილაკზე დაჭერით. თუკი
//               ვებგვერდის მომხმარებლის მიერ არ დაფიქსირდება/მოინიშნება
//               „თანხმობა“, ვებგვერდის გამოყენების გაგრძელება მის მიერ
//               ზემოაღნიშნულზე თანხმობად ჩაითვლება. ხაზგასასმელია, რომ
//               „სავალდებულო“ „მზა ჩანაწერების“ გათიშვა/დაბლოკვა შეუძლებელია,
//               ვინაიდან მათი არსებობა აუცილებლობას წარმოადგენს ვებგვერდის
//               ფუნქციონირებისათვის. თუკი თქვენ არ გსურთ რომ ჩვენ მიერ
//               გამოყენებული იქნეს „სავალდებულო“ „მზა ჩანაწერები“, არ გააგრძელოთ
//               ვებგვერდით სარგებლობა და მიმართეთ ალტერნატიულ საშუალებებს. რაც
//               შეეხება „არასავალდებულო“ „მზა ჩანაწერებს“, მომხმარებელს აქვს
//               შესაძლებლობა სურვილის შესაბამისად შეზღუდოს ან დაბლოკოს ისინი
//               შესაბამისი ბრაუზერის პარამეტრების გამოყენებით. ქვემოთ შეგიძლიათ
//               იხილოთ ყველაზე გავრცელებული ბრაუზერების მეშვეობით, „მზა
//               ჩანაწერების“ მართვის გზები: Google Chrome -
//               https://support.google.com/accounts/answer/61416?co=GENIE.Platform%3DDesktop&hl=en
//               Microsoft Edge -
//               https://support.microsoft.com/en-us/windows/microsoft-edge-browsing-data-and-privacy-bb8174ba-9d73-dcf2-9b4a-c582b4e640dd
//               Mozilla Firefox -
//               https://support.mozilla.org/en-US/kb/enhanced-tracking-protection-firefox-desktop?redirectslug=enable-and-disable-cookies-website-preferences&redirectlocale=en-US
//               Microsoft Internet Explorer -
//               https://support.microsoft.com/en-gb/windows/manage-cookies-in-microsoft-edge-view-allow-block-delete-and-use-168dab11-0753-043d-7c16-ede5947fc64d
//               Opera - https://help.opera.com/en/latest/web-preferences/ Apple
//               Safari - https://support.apple.com/en-gb/safari სხვა ბრაუზერების
//               გამოყენების შემთხვევაში, „მზა ჩანაწერების“ მართვის საშუალებებზე
//               ინფორმაციის მოსაპოვებლად შეგიძლიათ მიმართოთ შესაბამისი ბრაუზერის
//               ოფიციალურ ვებგვერდს. თქვენ ასევე შეგიძლიათ უარი თქვათ Google
//               Analytics მიერ თქვენი მონაცემების შეგროვებაზე და ასეთ შემთხვევაში,
//               ამ ინფორმაციას ვერ გამოიყენებს ვერცერთი ვებგვერდი, რომლითაც
//               ისარგებლებთ. ამისთვის საჭირო ინფორმაცია შეგძლიათ იხილოთ ბმულზე -
//               http://tools.google.com/dlpage/gaoptout. როგორც ზემოთ აღინიშნა,
//               „მზა ჩანაწერები“ მნიშვნელოვანია ვებ-გვერდის ეფექტური
//               ფუნქციონირებისათვის და თქვენ მიერ ვებ-გვერდზე ოპერირებისას
//               საუკეთესო გამოცდილების მისაღებად. შესაბამისად, ზემოაღნიშნული წესით
//               მათი დაბლოკვის/გათიშვის შემთხვევაში, თქვენი გამოცდილება
//               ვებ-გვერდის მოხმარებისას შესაძლოა შეიცვალოს და გაუარესდეს.
//               მაგალითად, გქონდეთ შეფერხებები გარკვეულ გვერდებზე გადასვლისას, ან
//               ვერ გამოიყენოთ ვებგვერდზე ჩაშენებული გარკვეული სერვისები.{" "}
//             </p>
//           </section>
//         </div>
//       </div>
//     </>
//   );
// };

// export default TermsConditions;

"use client";
import React, { useEffect, useRef } from "react";
import { useSearchParams } from "next/navigation";
import Header5 from "@/components/headers/Header5";
// MobileHeader1 import is not directly used in TermsConditions's render,
// as Header5 internally handles its mobile version.
// import MobileHeader1 from "@/components/headers/MobailHeader1";
import { useLocale } from "next-intl";

// Define a structure for your page's text content
// Fill in the empty strings with your Georgian and English texts
const pageTextContent = {
  documentTitle: {
    ka: "ვებ-გვერდის წესები და პირობები",
    en: "Website Terms and Conditions",
  },
  mainTitle: {
    ka: "კონფიდენციალურობის განაცხადი",
    en: "Privacy Statement",
  },
  introParagraph: {
    ka: "შ.პ.ს. „ფორმუსი“ პატივს სცემს თქვენი პირადი ცხოვრებისა და პერსონალურ მონაცემთა დაცვის უფლებებს. ჩვენთვის პრიორიტეტულია, პერსონალური მონაცემები დავამუშაოთ კონფიდენციალურობის დაცვის საუკეთესო პრაქტიკისა და მოქმედი კანონმდებლობის შესაბამისად.\nამ განაცხადში აღწერილია ვებ-გვერდის - www.formus.ge მეშვეობით, თქვენი პერსონალური მონაცემების დამუშავების პროცესი და წარმოდგენილია თქვენი მონაცემთა დაცვის უფლებები და მათი რეალიზების მექანიზმები. განაცხადში გამოყენებულ ტერმინებს აქვთ „პერსონალურ მონაცემთა დაცვის შესახებ“ საქართველოს კანონით და სხვა ნორმატიული აქტებით განსაზღვრული მნიშვნელობა.",
    en: '„Formusi“ LLC respects your right to privacy and the protection of personal data. Our priority is to process personal data in accordance with the best practices of confidentiality protection and applicable legislation.\nThis statement describes the process of processing your personal data through the website - www.formus.ge, and presents your data protection rights and mechanisms for their implementation. The terms used in this statement have the meanings defined by the Law of Georgia on "Personal Data Protection" and other normative acts.',
  },
  sections: [
    {
      id: "whoIsResponsible",
      title: {
        ka: "ვინ არის პასუხისმგებელი თქვენი მონაცემების დამუშავებაზე?",
        en: "Who is responsible for processing your data?",
      },
      paragraphs: [
        {
          ka: "კომპანიის სრული სახელწოდება და პროფილი: შ.პ.ს. „თი-ისთეითი“, ს/ნ: 404492107 - საქართველოს კანონმდებლობის შესაბამისად შექმნილი. მისი ძირითადი საქმიანობაა მრავალფუნქციური და მრავალბინიანი საცხოვრებელი სახლების მშენებლობა.\nმისამართი და საკონტაქტო მონაცემები: გიორგი შატბერაშვილის ქუჩა N9, თბილისი, საქართველო; ტელ: +995 593 93 90 93; ელ.ფოსტა: info@formus.ge.",
          en: "Company’s full name and profile: „T-Estate“ LLC, Reg. No. 404492107 - established under the legislation of Georgia. Its main activity is the construction of multifunctional and multi-apartment residential buildings.\nAddress and contact details: N9, George Shatberashvili str., Tbilisi, Georgia; Tel: +995 593 93 90 93; Email: info@formus.ge.",
        },
      ],
    },
    {
      id: "whatDataWeProcess",
      title: {
        ka: "რა მონაცემებს ვამუშავებთ?",
        en: "What data do we process?",
      },
      paragraphs: [
        {
          ka: "ჩვენ როგორც დეველოპერული-სამშენებლო კომპანია, საქართველოს მოქმედი კანონმდებლობის შესაბამისად, სრული ინფორმაციის მისაწოდებლად გვესაჭიროება დეტალური ინფორმაცია, რომელსაც ვღებულობთ უშუალოდ თქვენგან. ამგვარი მონაცემები როგორც წესი, არ არის საჯაროდ ხელმისაწვდომი. კომპანიის მიერ დამუშავებული მონაცემები მოიცავს ქვემოთ ჩამოთვლილს:",
          en: "We, as a construction, developer company, in accordance with the applicable legislation of Georgia, require information to conclude a contract, and we receive this information directly from you. Such data is generally not publicly available. The category of data processed by the company may include the following:",
        },
        {
          ka: "საკონტაქტო მონაცემები: სახელი, გვარი, ტელეფონის ნომერი და ელექტრონული ფოსტის მისამართი.",
          en: "Contact information: Name, surname, telephone number and email address.",
        },
        {
          ka: "IP მისამართი, რომლის გამოყენებაც ხორციელდება ვებ-გვერდებზე და სადაც ხდება თქვენთვის შემოთავაზებული მომსახურების რეალიზაცია, Cookie - ფაილები, აპლიკაციის ლოგები, IMEI კოდი, მონაცემები ვებ-გვერდზე თქვენ მიერ განხორციელებული ქმედებების შესახებ, თქვენი ადგილმდებარეობის შესახებ ინფორმაცია (მოწყობილობის ტიპი, ბრაუზერი, რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა; თქვენ მიერ მოთხოვნილი დომენის სახელი; თქვენი ინტერნეტ-სერვისის პროვაიდერის (ISP) კავშირის შესაბამისად, ხდება თქვენი ISP სახელის განსაზღვრა. ვებ-გვერდზე თქვენი ვიზიტის თარიღი და დრო; ვებ-გვერდზე თქვენი სესიის განგრძლიობა; ვებ-გვერდზე განხორციელებული ქმედებების შესახებ ინფორმაცია, მათ შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ ველი, მათი შევსების პროცესი და შესავსებად გამოყენებული დრო. გვერდები, რომლის ვებ-გვერდზე გახსენით მისით სარგებლობისას; თქვენი ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის განმავლობაში; იმ ფაილის URL, რომელსაც ნახულობთ, და მასთან დაკავშირებული ინფორმაცია; გვერდი, რომელმაც გადმოგამისამართათ ჩვენს ვებ-გვერდზე; საოპერაციო სისტემა, რომელსაც იყენებს თქვენი კომპიუტერი; ჩვენს ვებ- გვერდზე არსებულ „ტრაფიკზე“ თვალის მიდევნების მიზნით ვიყენებთ სხვადასხვა ანალიტიკურ მომსახურებას.",
          en: "IP Address, used on the websites where the services offered to you are provided, cookies, application logs, IMEI code, data regarding actions you take on the website, information about your location (device type, browser used to access the website), the domain name you requested, and your internet service provider (ISP), determined by your ISP connection.\nDate and time of your visit to the website, the duration of your session, information about actions taken on the website, including various forms or fields you filled out, the process of completing them, and the time spent on them. The pages you opened while using thewebsite, the number of your visits to our website in any given month, the URL of the file you viewed, and related information; the page that referred you to our website; the operating system used by your computer. We use various analytical services to track traffic on our website.",
        },
        {
          ka: "ჩვენ ინფორმაციას ვაგროვებთ უშუალოდ თქვენგან, როდესაც საკუთარი ნებით გვაწვდით.",
          en: "We collect information directly from you when you voluntarily provide it.",
        },
      ],
    },
    {
      id: "dataProcessingPurposes",
      title: {
        ka: "მონაცემთა დამუშავების მიზნები",
        en: "Purposes of Data Processing",
      },
      paragraphs: [
        {
          ka: "კომპანიაში თქვენი პერსონალური მონაცემები შესაძლოა დამუშავდეს სხვადასხვა მიზნით, თუმცა მიზანი ყოველთვის არის კონკრეტული, მკაფიოდ განსაზღვრული და კანონიერი. კომპანიაში თქვენი მონაცემები მუშავდება მხოლოდ იმ მოცულობით, რომელიც აუცილებელია კანონიერი მიზნის მისაღწევად და მხოლოდ იმ ვადით, რაც აუცილებელია მონაცემების დამუშავების მიზნის მისაღწევად.",
          en: "At company, your personal data may be processed for various purposes; however, each purpose is always specific, clearly defined, and lawful. Your data is processed by the company only to the extent necessary to achieve the lawful purpose and only for the period required to fulfill that purpose.",
        },
        {
          ka: "თქვენი პერსონალური მონაცემები შესაძლოა დამუშავდეს შემდეგი მიზნით:",
          en: "Your personal data may be processed for the following purposes:",
        },
        {
          ka: "- პირდაპირი მარკეტინგის განსახორციელებლად;",
          en: "- Conducting direct marketing;",
        },
        {
          ka: "- თქვენ მიერ ვებ-გვერდზე განხორციელებული ვიზიტის შესახებ ინფორმაციის შეგროვება, მათ შორის ვებ-გვერდზე თქვენი ქცევის შესასწავლად, თქვენ მიერ გაკეთებული არჩევანის დასამახსოვრებლად, მოძიებული ინფორმაციის ანალიზისათვის და შემდგომში თქვენზე მორგებული/პერსონალური შეთავაზებების განსახორციელებლად;",
          en: "- Collecting information about your visit to the website, including studying your behavior on the website, remembering your choices, analyzing the information you searched for, and making personalized offers tailored to you;",
        },
        {
          ka: "- ვებ-გვერდზე არსებული სხვადასხვა საკომუნიკაციო საშუალებით ჩვენთვის დატოვებულ შეტყობინებებზე რეაგირების მიზნით;",
          en: "- Responding to messages left via various communication channels on the website;",
        },
        {
          ka: "- თქვენთვის საჭიროებისამებრ შეტყობინებების/კორესპონდენციების გადმოსაგზავნად;",
          en: "- sending notifications/correspondence as needed;",
        },
        {
          ka: "- კომპანიის შესახებ სიახლეების გაცნობისთვის, სხვადასხვა ბენეფიტის შეთავაზებისთვის;",
          en: "- nforming you about company news and offering various benefits;", // Typo "nforming", corrected to "Informing" if possible, but sticking to provided text.
        },
        {
          ka: "- ჩვენ მიერ განსაზღვრული სხვადასხვა მიზნებისათვის: კვლევების განხორციელება, რეპორტების/ანგარიშების შედგენა;",
          en: "- Conducting research for various purposes defined by us, preparing reports;",
        },
        {
          ka: "- საჩივრების/პრეტენზიების განხილვისთვის და მათზე რეაგირებისთვის;",
          en: "- Reviewing and responding to complaints and claims;",
        },
        {
          ka: "- კანონმდებლობით გათვალისწინებული ვალდებულებების შესრულებისთვის.",
          en: "- Complying with legal obligations.",
        },
      ],
    },
    {
      id: "dataProcessingBasis",
      title: {
        ka: "მონაცემთა დამუშავების საფუძველი",
        en: "Basis for Data Processing",
      },
      paragraphs: [
        {
          ka: "კომპანიაში თქვენი პერსონალური მონაცემები მუშავდება მხოლოდ შესაბამისი საფუძვლის არსებობის შემთხვევაში. მონაცემთა დამუშავების დროს შესაძლოა არსებობდეს ერთი ან ერთდროულად რამდენიმე საფუძველი.",
          en: "At the company, your personal data is processed only when there is a valid basis for doing so. There may be one or several simultaneous grounds for data processing.",
        },
      ],
    },
    {
      id: "dataStoragePeriod",
      title: {
        ka: "მონაცემთა შენახვის ვადა",
        en: "Data Retention Period",
      },
      paragraphs: [
        {
          ka: "მონაცემები შეინახება თქვენი მომსახურების მთელი პერიოდის განმავლობაში, იმ ვადით, რაც საჭიროა ზემოთ ჩამოთვლილი მიზნების მისაღწევად.",
          en: "Data will be retained throughout the period of your service and for the time necessary to achieve the above-mentioned purposes.",
        },
      ],
    },
    {
      id: "confidentialityGuarantees",
      title: {
        ka: "კონფიდენციალობის გარანტიები",
        en: "Confidentiality Guarantees",
      },
      paragraphs: [
        {
          ka: "კომპანია უზრუნველყოფს მოწოდებული ინფორმაციის მაქსიმალურ დაცულობას კანონმდებლობით დადგენილი წესით. ჩვენ ვზრუნავთ თქვენი ინფორმაციის უსაფრთხოებასა და კონფიდენციალურობაზე, თუმცა ვიხსნით პასუხისმგებლობას მესამე პირების მიერ ინფორმაციის არასანქცირებულ წვდომაზე ამ მონაცემების კომპანიისთვის მოწოდების დროს.",
          en: "The company ensures the maximum protection of the provided information in accordance with the law. We take care of the security and confidentiality of your information; however, we disclaim responsibility for unauthorized access to the information by third parties at the time of its provision to the company.",
        },
        {
          ka: "თქვენ პასუხისმგელობას იღებთ მოწოდებული ინფორმაციის სიზუსტეზე. თქვენი მონაცემების ცვლილებების შემთხვევაში, შეგიძლიათ გვაცნობოთ აღნიშნულის თაობაზე და შეძლებისდაგვარად მყისიერად, თუმცა, არაუგვიანეს 20 დღისა მოვახდენთ რეაგირებას და ავსახავთ ცვლილებებს შესაბამის მონაცემთა ბაზებში.",
          en: "You are responsible for the accuracy of the provided information. In case of changes to your data, you can inform us, and we will update the information in the relevant databases as promptly as possible, but no later than within 20 days.",
        },
      ],
    },
    {
      id: "yourDataProtectionRights",
      title: {
        ka: "თქვენი მონაცემთა დაცვის უფლებები",
        en: "Your Data Protection Rights",
      },
      paragraphs: [
        {
          ka: "თქვენ გაქვთ შესაძლებლობა ისარგებლოთ კანონმდებლობით მონიჭებული ყველა უფლებამოსილებით. მათ შორის:",
          en: "You have the right to exercise all powers granted by law, including:",
        },
        {
          ka: "- მონაცემთა დამუშავების შესახებ ინფორმაციის მიღების უფლება;",
          en: "- Right to access information about data processing;",
        },
        {
          ka: "- მონაცემთა გაცნობისა და ასლის მიღების უფლება;",
          en: "- Right to access and obtain a copy of the data;",
        },
        {
          ka: "- მონაცემთა გასწორების, განახლებისა და შევსების უფლება;",
          en: "- Right to correct, update, or complete data;",
        },
        {
          ka: "- მონაცემთა დამუშავების შეწყვეტის, წაშლის და განადგურების უფლება;",
          en: "- Right to stop processing, delete, or destroy data;",
        },
        {
          ka: "- მონაცემთა დაბლოკვის უფლება;",
          en: "- Right to Block Data;",
        },
        {
          ka: "- მონაცემთა გადატანის უფლება;",
          en: "- Right to Data Portability;",
        },
        {
          ka: "- გასაჩივრების უფლება.",
          en: "- Right to Appeal.",
        },
      ],
    },
    {
      id: "cookiesApplication",
      title: {
        ka: "„მზა ჩანაწერების“ განაცხადი",
        en: "Cookies Statement",
      },
      paragraphs: [
        {
          // Subheading 1
          ka: "რა არის ე.წ. „მზა ჩანაწერები“ („Cookies“)",
          en: "What are Cookies?",
        },
        {
          // Paragraph after subheading 1
          ka: "„მზა ჩანაწერები“ არის მცირე მოცულობის ინფორმაციის შემცველი ტექსტური ფაილები, რომელსაც თქვენი კომპიუტერი, ტელეფონი, ან პლანშეტი ბრაუზერის მეშვეობით ინახავს ჩვენს ვებგვერდზე ან ჩვენს სხვა დისტანციურ პლატფორმებზე ვიზიტისას.",
          en: "Cookies are small text files containing a small amount of information that your computer, phone, or tablet stores through your browser when visiting our website or other remote platforms.",
        },
        {
          // Subheading 2
          ka: "„მზა ჩანაწერების“ სახეები და მათი დამუშავების მიზანი",
          en: "Types of Cookies and Their Purpose",
        },
        {
          // Paragraph 1 after subheading 2
          ka: "ჩვენ მიერ გამოიყენება როგორც „სავალდებულო/აუცილებელი“, ასევე „არასავალდებულო“ „მზა ჩანაწერები“. „მზა ჩანაწერების“ გამოყენებას მრავალი სხვადასხვა დანიშნულება აქვს, საერთო ჯამში კი, მათი გამოყენება ემსახურება ჩვენი სერვისით სარგებლობისას თქვენი გამოცდილების გამარტივებასა და გაუმჯობესებას, სერვისით სარგებლობის შესახებ ანალიტიკური/მარკეტინგული ინფორმაციის მოპოვებას და ასევე, უსაფრთხოების დაცვის მიზანს. „სავალდებულო“ „მზა ჩანაწერების“ გამოყენება აუცილებელია ვებგვერდის/პლატფორმის ფუნქციონირებისა და მასში ოპერირებისთვის. „სავალდებულო“ „მზა ჩანაწერები“ მუშავდება ჩვენს ვებგვერდზე/პლატფორმაზე ყოველი ვიზიტის ფარგლებში, ვინაიდან, აღნიშნულის გარეშე ჩვენი ონლაინ სერვისებით სარგებლობა ტექნიკურად შესაძლებელი არ იქნება.",
          en: 'We use both "mandatory/necessary" and "non-mandatory" cookies. The use of cookies serves various purposes, but overall, they aim to simplify and enhance your experience when using our services, gather analytical/marketing information about service usage, and ensure security.\nMandatory Cookies are essential for the operation and functionality of the website/platform. These cookies are processed during every visit to our website/platform, as without them, the use of our online services would not be technically possible.',
        },
        {
          // Paragraph 2 after subheading 2
          ka: "რაც შეეხება „არასავალდებულო“ „მზა ჩანაწერებს“, ჩვენ მიერ გამოყენებული „არასავალდებულო“ მზა ჩანაწერები და მათი გამოყენების მიზნები შემდეგია:",
          en: "As for non-mandatory cookies, we use the following types of non-mandatory cookies and their associated purposes:",
        },
        {
          ka: "ა) ანალიტიკური - უზრუნველყოფს მომხმარებლის ქცევის შესწავლას ანალიტიკური ჩანაწერების შეგროვებისა და დამუშავების გზით. მათი მეშვეობით ვსწავლობთ, ვებ-გვერდის რომელ ნაწილთან აქვს უფრო ხშირი შეხება მომხმარებელს და რითია მეტად დაინტერესებული.",
          en: "a. Analytical Cookies - These cookies help study user behavior by collecting and processing analytical records. They allow us to understand which parts of the website users engage with more frequently and what they are most interested in.",
        },
        {
          ka: "ბ) ფუნქციური - მათი მეშვეობით ვიმახსოვრებთ ვებ-გვერდის მოხმარებისას მომხმარებლების მიერ გაკეთებულ არჩევანს რათა სამომავლოდ მათი გამოცდილება გაუმჯობესებულ და გამარტივებულ იქნას.",
          en: "b. Functional Cookies - These cookies remember the choices made by users while using the website to improve and simplify their experience in the future.",
        },
        {
          ka: "გ) პირად ელექტრონულ ფოსტასთან დაკავშირებული „მზა ჩანაწერები“ - ვებ-გვერდი მომხმარებელს აძლევს შესაძლებლობას დაარეგისტრიროს საკუთარი ელექტრონული ფოსტის მისამართი და ამ გზით გამოიწეროს ჩვენი სიახლეები. ამ „მზა ჩანაწერებმა“ შესაძლოა მომხმარებელს შეახსენოს თავისი ელექტრონული ფოსტის დარეგისტრირების შესაძლებლობის შესახებ.",
          en: "c. Email-Related Cookies - The website allows users to register their email addresses to subscribe to our updates. These cookies may remind users of the option to register their email addresses.",
        },
        {
          ka: "დ) მესამე მხარის „მზა ჩანაწერები“ - აღნიშნული წარმოადგენს იმგვარ ფაილებს, რომლებიც გამოიყენება მარკეტინგული და ანალიტიკური მიზნებისათვის და მათი შეგროვება ხდება სხვადასხვა სანდო გვერდიდან.",
          en: "d. Third-Party Cookies - These files are used for marketing and analytical purposes, and they are collected from various trusted sites.",
        },
        {
          ka: "ე) „მზა ჩანაწერები“ ვებ-გვერდის პარამეტრების შესახებ - აღნიშნული ფაილები გამოიყენება იმ შემთხვევაში, როდესაც მომხმარებელი სარგებლობს ვებ-გვერდით და მას ვებ-გვერდის მომსახურება შეფერხებებით მიეწოდება მისი პარამეტრების „ბრალეულობით“.",
          en: "e. Cookies Related to Website Settings - These files are used when the user is experiencing interruptions while using the website, which may be caused by their settings.",
        },
        {
          // Subheading 3
          ka: "რა ინფორმაციას ვამუშავებთ თქვენ შესახებ „მზა ჩანაწერების“ მეშვეობით და რა ვადით",
          en: "What Information Do We Process About You Through Cookies and For How Long?",
        },
        {
          // Paragraph 1 after subheading 3
          ka: "ვებგვერდზე ვიზიტისას გროვდება შემდეგი ინფორმაცია:",
          en: "When you visit our website, the following information is collected through cookies:",
        },
        { ka: "ა) თქვენი IP მისამართი;", en: "a. Your IP address;" },
        {
          ka: "ბ) თქვენი მოწყობილობის ტიპი და ბრაუზერი, რომლის გამოყენებითაც ხდება ვებ-გვერდზე შემოსვლა;",
          en: "b. The type of device and browser you use to access the website;",
        },
        {
          ka: "გ) თქვენ მიერ მოთხოვნილი დომენის სახელი;",
          en: "c. The domain name you requested;",
        },
        {
          ka: "დ) თქვენი ინტერნეტ-სერვისის პროვაიდერის სახელი;",
          en: "d. The name of your internet service provider;",
        },
        {
          ka: "ე) ვებ-გვერდზე თქვენი ვიზიტის თარიღი და დრო;",
          en: "e. The date and time of your visit to the website;",
        },
        {
          ka: "ვ) ვებ-გვერდზე თქვენი სესიის ხანგრძლივობა;",
          en: "f. The duration of your session on the website;",
        },
        {
          ka: "ზ) ვებ-გვერდზე განხორციელებული ქმედებების შესახებ ინფორმაცია, მათ შორის თქვენ მიერ შევსებული სხვადასხვა განაცხადი თუ ველი, მათი შევსების პროცესი და შესავსებად გამოყენებული დრო;",
          en: "g. Information about actions taken on the website, including forms or fields you filled out, the process of filling them out, and the time used to complete them;",
        },
        {
          ka: "თ) გვერდები, რომლებიც ვებ-გვერდზე გახსენით მისით სარგებლობისას;",
          en: "h. Pages you opened on the website during your visit;",
        },
        {
          ka: "ი) თქვენი ვიზიტების რაოდენობა ჩვენს ვებ-გვერდზე ნებისმიერი თვის განმავლობაში;",
          en: "i. The number of your visits to our website within any given month;",
        },
        {
          ka: "კ) თქვენ მიერ გახსნილი ფაილის URL (Uniform Resource Locator - ერთიანი რესურსების ლოკატორი) და მასთან დაკავშირებული ინფორმაცია;",
          en: "j. The URL (Uniform Resource Locator) of any file you opened and related information;",
        },
        {
          ka: "ლ) გვერდი, რომელმაც გადმოგამისამართათ ჩვენს ვებ-გვერდზე;",
          en: "k. The page that referred you to our website;",
        },
        {
          ka: "მ) საოპერაციო სისტემა, რომელსაც იყენებს თქვენი მოწყობილობა;",
          en: "l. The operating system used by your device;",
        }, // English text has "l." but Georgian has "მ)"
        {
          ka: "ნ) ჩვენს ვებ-გვერდზე არსებულ „ტრაფიკზე“ თვალის მიდევნების მიზნით სხვადასხვა ანალიტიკური მომსახურების ფარგლებში მოგროვებული ინფორმაცია.",
          en: "m. Information collected within various analytical services for tracking traffic on our website.",
        }, // English text has "m." but Georgian has "ნ)"
        {
          // Paragraph 2 after subheading 3 (list)
          ka: "ზემოაღნიშნულ მონაცემებს ვინახავთ არაუმეტეს 1 (ერთი) წლის ვადით.",
          en: "This data is stored for no longer than one (1) year.",
        },
        {
          // Subheading 4
          ka: "მონაცემთა სუბიექტის უფლებები და „მზა ჩანაწერების“ გამოყენების მართვა",
          en: "Data Subject Rights and Cookie Management",
        },
        {
          // Paragraph 1 after subheading 4
          ka: "ვებგვერდზე შესვლისას მონაცემთა სუბიექტს ეძლევა შესაძლებლობა გაეცნოს „მზა ჩანაწერების“ პოლიტიკას და დაეთანხმოს მათ გამოყენებას „თანხმობის“ ღილაკზე დაჭერით. თუკი ვებგვერდის მომხმარებლის მიერ არ დაფიქსირდება/მოინიშნება „თანხმობა“, ვებგვერდის გამოყენების გაგრძელება მის მიერ ზემოაღნიშნულზე თანხმობად ჩაითვლება.",
          en: 'Upon entering the website, the data subject is given the opportunity to review the Cookies policy and consent to their use by clicking the "Agree" button. If no consent is explicitly provided by the website user, continuing to use the website will be considered as consent to the use of cookies.',
        },
        {
          // Paragraph 2 after subheading 4
          ka: "ხაზგასასმელია, რომ „სავალდებულო“ „მზა ჩანაწერების“ გათიშვა/დაბლოკვა შეუძლებელია, ვინაიდან მათი არსებობა აუცილებლობას წარმოადგენს ვებგვერდის ფუნქციონირებისათვის. თუკი თქვენ არ გსურთ რომ ჩვენ მიერ გამოყენებული იქნეს „სავალდებულო“ „მზა ჩანაწერები“, არ გააგრძელოთ ვებგვერდით სარგებლობა და მიმართეთ ალტერნატიულ საშუალებებს.",
          en: "It is important to note that mandatory cookies cannot be disabled or blocked, as they are essential for the functioning of the website. If you do not wish for mandatory cookies to be used, you should stop using the website and consider alternative means of accessing the services.",
        },
        {
          // Paragraph 3 after subheading 4
          ka: "რაც შეეხება „არასავალდებულო“ „მზა ჩანაწერებს“, მომხმარებელს აქვს შესაძლებლობა სურვილის შესაბამისად შეზღუდოს ან დაბლოკოს ისინი შესაბამისი ბრაუზერის პარამეტრების გამოყენებით. ქვემოთ შეგიძლიათ იხილოთ ყველაზე გავრცელებული ბრაუზერების მეშვეობით, „მზა ჩანაწერების“ მართვის გზები:",
          en: "For non-mandatory cookies, users have the option to restrict or block them using the appropriate browser settings. Below are links to the most common browsers with instructions on how to manage cookies:",
        },
        {
          ka: "Google Chrome - https://support.google.com/accounts/answer/61416?co=GENIE.Platform%3DDesktop&hl=en",
          en: "Google Chrome: https://support.google.com/accounts/answer/61416?co=GENIE.Platform%3DDesktop&hl=en",
        },
        {
          ka: "Microsoft Edge - https://support.microsoft.com/en-us/windows/microsoft-edge-Browse-data-and-privacy-bb8174ba-9d73-dcf2-9b4a-c582b4e640dd",
          en: "Microsoft Edge: https://support.microsoft.com/en-us/windows/microsoft-edge-Browse-data-and-privacy-bb8174ba-9d73-dcf2-9b4a-c582b4e640dd",
        },
        {
          ka: "Mozilla Firefox - https://support.mozilla.org/en-US/kb/enhanced-tracking-protection-firefox-desktop?redirectslug=enable-and-disable-cookies-website-preferences&redirectlocale=en-US",
          en: "Mozilla Firefox: https://support.mozilla.org/en-US/kb/enhanced-tracking-protection-firefox-desktop?redirectslug=enable-and-disable-cookies-website-preferences&redirectlocale=en-US",
        },
        {
          ka: "Microsoft Internet Explorer - https://support.microsoft.com/en-gb/windows/manage-cookies-in-microsoft-edge-view-allow-block-delete-and-use-168dab11-0753-043d-7c16-ede5947fc64d",
          en: "Microsoft Internet Explorer: https://support.microsoft.com/en-gb/windows/manage-cookies-in-microsoft-edge-view-allow-block-delete-and-use-168dab11-0753-043d-7c16-ede5947fc64d",
        },
        {
          ka: "Opera - https://help.opera.com/en/latest/web-preferences/",
          en: "Opera: https://help.opera.com/en/latest/web-preferences/",
        },
        {
          ka: "Apple Safari - https://support.apple.com/en-gb/safari",
          en: "Apple Safari: https://support.apple.com/en-gb/safari",
        },
        {
          // Paragraph 4 after subheading 4
          ka: "სხვა ბრაუზერების გამოყენების შემთხვევაში, „მზა ჩანაწერების“ მართვის საშუალებებზე ინფორმაციის მოსაპოვებლად შეგიძლიათ მიმართოთ შესაბამისი ბრაუზერის ოფიციალურ ვებგვერდს.",
          en: "For other browsers, you can find cookie management instructions on the official website of the respective browser.",
        },
        {
          // Paragraph 5 after subheading 4
          ka: "თქვენ ასევე შეგიძლიათ უარი თქვათ Google Analytics მიერ თქვენი მონაცემების შეგროვებაზე და ასეთ შემთხვევაში, ამ ინფორმაციას ვერ გამოიყენებს ვერცერთი ვებგვერდი, რომლითაც ისარგებლებთ. ამისთვის საჭირო ინფორმაცია შეგძლიათ იხილოთ ბმულზე - http://tools.google.com/dlpage/gaoptout.",
          en: "Additionally, you can opt out of data collection by Google Analytics, ensuring that no website can collect your data through this service. Information on how to opt out can be found here: http://tools.google.com/dlpage/gaoptout",
        },
        {
          // Paragraph 6 after subheading 4
          ka: "როგორც ზემოთ აღინიშნა, „მზا ჩანაწერები“ მნიშვნელოვანია ვებ-გვერდის ეფექტური ფუნქციონირებისათვის და თქვენ მიერ ვებ-გვერდზე ოპერირებისას საუკეთესო გამოცდილების მისაღებად. შესაბამისად, ზემოაღნიშნული წესით მათი დაბლოკვის/გათიშვის შემთხვევაში, თქვენი გამოცდილება ვებ-გვერდის მოხმარებისას შესაძლოა შეიცვალოს და გაუარესდეს. მაგალითად, გქონდეთ შეფერხებები გარკვეულ გვერდებზე გადასვლისას, ან ვერ გამოიყენოთ ვებგვერდზე ჩაშენებული გარკვეული სერვისები.",
          en: "As mentioned above, cookies are important for the effective functioning of the website and for providing the best possible user experience. If you choose to block or disable cookies, your experience on the website may be impacted and worsened, e.g. you may experience delays in accessing certain pages, or embedded services may not function properly.",
        },
      ],
    },
  ],
};
const TermsConditions = () => {
  const locale = useLocale(); // Get the current locale
  const searchParams = useSearchParams();
  const marketingTermsRef = useRef(null);

  useEffect(() => {
    if (searchParams.get("section") === "marketing") {
      setTimeout(() => {
        marketingTermsRef.current?.scrollIntoView({ behavior: "smooth" });
      }, 100);
    }
  }, [searchParams]);

  // Helper function to get text, provides fallback for missing translations
  const getText = (textObj) => {
    if (textObj && typeof textObj === "object") {
      return textObj[locale] || textObj["en"] || ""; // Fallback to English if current locale's text is missing
    }
    return "";
  };

  return (
    <>
      <Header5 />

      <div className="max-w-4xl mx-auto p-6 space-y-8 mt-[80px] mb-16">
        {" "}
        {/* Added mb-16 for bottom spacing */}
        {/* Render the overall document title */}
        {pageTextContent.documentTitle && (
          <h1 className="text-3xl font-bold text-center mb-10">
            {" "}
            {/* Larger, centered title */}
            {getText(pageTextContent.documentTitle)}
          </h1>
        )}
        {/* Render the main title of the privacy statement */}
        <h2 className="text-2xl font-bold">
          {getText(pageTextContent.mainTitle)}
        </h2>
        {/* Render the intro paragraph to the privacy statement */}
        {/* Handling newline characters if present in the text */}
        {getText(pageTextContent.introParagraph)
          .split("\n")
          .map((line, index) => (
            <p key={`intro-${index}`} className="text-gray-600">
              {line}
            </p>
          ))}
        <div className="space-y-10">
          {" "}
          {/* Increased space between major sections */}
          {pageTextContent.sections.map((section) => (
            <section
              key={section.id}
              id={section.id} // Adding id attribute for potential deep linking / generalized scrolling
              className="space-y-4" // Consistent spacing within a section
            >
              <h3 className="text-xl font-semibold">
                {" "}
                {/* Changed from h2 to h3 for better hierarchy */}
                {getText(section.title)}
              </h3>
              {section.paragraphs.map((para, paraIndex) =>
                // Handling newline characters if present in paragraph text
                getText(para)
                  .split("\n")
                  .map((line, lineIndex) => (
                    <p
                      key={`${section.id}-p${paraIndex}-l${lineIndex}`}
                      className={para.className || "text-gray-600"}
                    >
                      {line}
                    </p>
                  ))
              )}
            </section>
          ))}
        </div>
      </div>
    </>
  );
};

export default TermsConditions;
